index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-03-03 Sun 08:51 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Jonathan Jin&rsquo;s Emacs Configuration</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Jonathan Jin" />
<link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Jonathan Jin&rsquo;s Emacs Configuration</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org1c11971">1. Preamble</a>
<ul>
<li><a href="#org9ae69d1">1.1. Front Matter</a>
<ul>
<li><a href="#orgf7af5d4">1.1.1. Straight</a></li>
<li><a href="#org552b9b1">1.1.2. <code>use-package</code></a></li>
<li><a href="#org18886ab">1.1.3. Baseline</a></li>
</ul>
</li>
<li><a href="#orgfa05fc6">1.2. Functions</a></li>
</ul>
</li>
<li><a href="#orgc8ee4cf">2. General Configurations</a>
<ul>
<li><a href="#org7ed58a3">2.1. Scratch Org-mode</a></li>
<li><a href="#org516b304">2.2. Appearance</a>
<ul>
<li><a href="#orga9a836a">2.2.1. Themes</a></li>
<li><a href="#org5b810f4">2.2.2. General</a></li>
</ul>
</li>
<li><a href="#org2139ec7">2.3. Environment-specific</a>
<ul>
<li><a href="#org7b3dccd">2.3.1. Mac</a></li>
</ul>
</li>
<li><a href="#org8c6059e">2.4. Server</a></li>
<li><a href="#orgcff0145">2.5. &ldquo;Launcher&rdquo;</a></li>
<li><a href="#orgabd8ccc">2.6. Nested .dir-locals.el</a></li>
</ul>
</li>
<li><a href="#org0a25365">3. Keys</a>
<ul>
<li><a href="#org270c1a9">3.1. Personal maps</a></li>
<li><a href="#org15a8c0a">3.2. Keybindings</a></li>
</ul>
</li>
<li><a href="#org41ab046">4. Development Environments</a>
<ul>
<li><a href="#orge2b1bc6">4.1. General Style</a></li>
<li><a href="#org12b0a4d">4.2. Aurora</a></li>
<li><a href="#orgeca1b6a">4.3. C/C++</a></li>
<li><a href="#org1596cf8">4.4. Go</a></li>
<li><a href="#orge16f6a3">4.5. Lisp</a></li>
<li><a href="#org355adee">4.6. Javascript</a></li>
<li><a href="#orgfb90b1a">4.7. LaTeX</a></li>
<li><a href="#orgb1a7827">4.8. zsh</a></li>
<li><a href="#orga8eb3c9">4.9. Haskell</a></li>
<li><a href="#org2505515">4.10. Pants</a></li>
<li><a href="#org583d919">4.11. Ruby</a></li>
<li><a href="#orgf8cd0b1">4.12. SQL</a></li>
<li><a href="#org605bf23">4.13. Thrift</a></li>
<li><a href="#orgf5f6933">4.14. Octave</a></li>
<li><a href="#orge23d01f">4.15. Matlab</a></li>
<li><a href="#org8ec3689">4.16. Python</a></li>
<li><a href="#org11b85df">4.17. Emacs Lisp</a></li>
<li><a href="#org2f48343">4.18. Markdown</a></li>
<li><a href="#org76316bc">4.19. YAML</a></li>
<li><a href="#org1ed32b5">4.20. Twitter</a></li>
<li><a href="#org0824464">4.21. Scala</a></li>
</ul>
</li>
<li><a href="#org4c1c019">5. General Packages</a>
<ul>
<li><a href="#org261b68c">5.1. <code>ace-link</code></a></li>
<li><a href="#org762fc38">5.2. <code>ace-window</code></a></li>
<li><a href="#org6416574">5.3. <code>ansi-color</code></a></li>
<li><a href="#org7d397cb">5.4. <code>browse-url</code></a></li>
<li><a href="#org7b9d62a">5.5. <code>calc</code></a></li>
<li><a href="#org2d59f24">5.6. <code>conf-mode</code></a></li>
<li><a href="#orgbfeb6d5">5.7. <code>company</code></a></li>
<li><a href="#org2de88a5">5.8. <code>dired</code></a></li>
<li><a href="#org444a83e">5.9. <code>doc-view-mode</code></a></li>
<li><a href="#org3dc0d0b">5.10. <code>ediff</code></a></li>
<li><a href="#org186c91a">5.11. <code>exec-path-from-shell</code></a></li>
<li><a href="#org87ba4eb">5.12. Elfeed</a></li>
<li><a href="#org44ad9c2">5.13. Eshell</a>
<ul>
<li><a href="#org32ea771">5.13.1. Initialization file</a></li>
</ul>
</li>
<li><a href="#org7ce2f71">5.14. <code>ess</code></a></li>
<li><a href="#org9f02ea0">5.15. Evil (base + extras)</a></li>
<li><a href="#orgf6fa121">5.16. <code>fill-column-indicator</code></a></li>
<li><a href="#org6067f41">5.17. <code>flycheck</code></a></li>
<li><a href="#orgac2c73c">5.18. Git</a>
<ul>
<li><a href="#orgc25de86">5.18.1. <code>git-commit-mode</code></a></li>
<li><a href="#org5e16011">5.18.2. <code>gitconfig-mode</code></a></li>
<li><a href="#org57f1c6c">5.18.3. <code>gitignore-mode</code></a></li>
<li><a href="#org7f4405c">5.18.4. Magit</a></li>
</ul>
</li>
<li><a href="#org2062ab3">5.19. <code>helm</code></a></li>
<li><a href="#orgabb670a">5.20. <code>linum</code></a></li>
<li><a href="#org060a9a2">5.21. <code>multi-term</code></a></li>
<li><a href="#orge1783e7">5.22. <code>mu4e</code></a></li>
<li><a href="#orge70e1bc">5.23. <code>org-mode</code></a></li>
<li><a href="#org116d2c2">5.24. Org-page</a></li>
<li><a href="#orgfc89dac">5.25. <code>pdf-tools</code></a></li>
<li><a href="#org34a2e22">5.26. <code>projectile</code></a></li>
<li><a href="#orgab18d6d">5.27. <code>rich-minority-mode</code></a></li>
<li><a href="#org34a7a35">5.28. <code>smart-mode-line</code></a></li>
<li><a href="#orgbd40932">5.29. <code>tramp</code></a></li>
<li><a href="#org15edbe5">5.30. <code>undo-tree</code></a></li>
<li><a href="#orgc186910">5.31. <code>w3m</code></a></li>
</ul>
</li>
<li><a href="#org19b85a4">6. (Un)license</a></li>
</ul>
</div>
</div>

<div id="outline-container-org1c11971" class="outline-2">
<h2 id="org1c11971"><span class="section-number-2">1</span> Preamble</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(add-to-list 'load-path (expand-file-name <span style="color: #A3BE8C;">"~/.emacs.d/elpa"</span>))

(<span style="color: #81A1C1;">setq</span> package-archives '((<span style="color: #A3BE8C;">"gnu"</span>           . <span style="color: #A3BE8C;">"http://elpa.gnu.org/packages/"</span>)
                          (<span style="color: #A3BE8C;">"melpa-stable"</span> . <span style="color: #A3BE8C;">"http://stable.melpa.org/packages/"</span>)
                          (<span style="color: #A3BE8C;">"melpa"</span>        . <span style="color: #A3BE8C;">"http://melpa.org/packages/"</span>)
                          (<span style="color: #A3BE8C;">"org"</span>          . <span style="color: #A3BE8C;">"http://orgmode.org/elpa/"</span>)))

(package-initialize)
</pre>
</div>
</div>

<div id="outline-container-org9ae69d1" class="outline-3">
<h3 id="org9ae69d1"><span class="section-number-3">1.1</span> Front Matter</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-orgf7af5d4" class="outline-4">
<h4 id="orgf7af5d4"><span class="section-number-4">1.1.1</span> Straight</h4>
<div class="outline-text-4" id="text-1-1-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #81A1C1;">let</span> ((bootstrap-file
       (expand-file-name <span style="color: #A3BE8C;">"straight/repos/straight.el/bootstrap.el"</span> user-emacs-directory))
      (bootstrap-version 4))
  (<span style="color: #81A1C1;">unless</span> (file-exists-p bootstrap-file)
    (<span style="color: #81A1C1;">with-current-buffer</span>
        (url-retrieve-synchronously
         <span style="color: #A3BE8C;">"https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"</span>
         'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(straight-use-package 'use-package)
(<span style="color: #81A1C1;">use-package</span> <span style="color: #81A1C1;">use-package-ensure-system-package</span>
  <span style="color: #81A1C1;">:straight</span> t)
</pre>
</div>
</div>
</div>

<div id="outline-container-org552b9b1" class="outline-4">
<h4 id="org552b9b1"><span class="section-number-4">1.1.2</span> <code>use-package</code></h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
The <code>:if</code> clause lets us suppress configuration/loading of a given package
if a provided condition doesn&rsquo;t hold. The following will log such cases
non-fatally.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #81A1C1;">defun</span> <span style="color: #88C0D0;">jjin/use-package-if-prehook</span> (name _keyword pred rest state)
  (<span style="color: #81A1C1;">if</span> (not pred) (<span style="color: #EBCB8B;">error</span> <span style="color: #A3BE8C;">"predicate failed; skipping package"</span>)))

(advice-add 'use-package-handler/:if <span style="color: #81A1C1;">:before</span> 'jjin/use-package-if-prehook)
</pre>
</div>
</div>
</div>

<div id="outline-container-org18886ab" class="outline-4">
<h4 id="org18886ab"><span class="section-number-4">1.1.3</span> Baseline</h4>
<div class="outline-text-4" id="text-1-1-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #81A1C1;">use-package</span> <span style="color: #81A1C1;">diminish</span> <span style="color: #81A1C1;">:straight</span> t)

(<span style="color: #81A1C1;">use-package</span> <span style="color: #81A1C1;">names</span>
  <span style="color: #81A1C1;">:straight</span> t)

(<span style="color: #81A1C1;">use-package</span> <span style="color: #81A1C1;">system-packages</span>
  <span style="color: #81A1C1;">:straight</span> t
  <span style="color: #81A1C1;">:init</span>
  (<span style="color: #81A1C1;">when</span> (eq system-type 'darwin)
    (<span style="color: #81A1C1;">setq</span> system-packages-package-manager 'brew)))
</pre>
</div>
</div>
</div>
</div>
