index.html

<div id="outline-container-orgfa05fc6" class="outline-3">
<h3 id="orgfa05fc6"><span class="section-number-3">1.2</span> Functions</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #81A1C1;">define-namespace</span> jjin-
(<span style="color: #81A1C1;">defun</span> <span style="color: #88C0D0;">load-if-exists</span> (file)
  <span style="color: #616e88;">"Loads file, conditional on its existence; no effect if non-existent."</span>
  (<span style="color: #81A1C1;">when</span> (file-exists-p file)
    (load-file file)))

(<span style="color: #81A1C1;">defun</span> <span style="color: #88C0D0;">kill-current-buffer</span> ()
  (<span style="color: #81A1C1;">interactive</span>)
  (kill-buffer (current-buffer)))

(<span style="color: #81A1C1;">defun</span> <span style="color: #88C0D0;">window-toggle-split-direction</span> ()
  <span style="color: #616e88;">"Switch window split from horizontally to vertically, or vice versa.</span>

<span style="color: #616e88;">i.e. change right window to bottom, or change bottom window to right."</span>
  (<span style="color: #81A1C1;">interactive</span>)
  (<span style="color: #81A1C1;">require</span> '<span style="color: #81A1C1;">windmove</span>)
  (<span style="color: #81A1C1;">let</span> ((done))
    (<span style="color: #81A1C1;">dolist</span> (dirs '((right . down) (down . right)))
      (<span style="color: #81A1C1;">unless</span> done
        (<span style="color: #81A1C1;">let*</span> ((win (selected-window))
               (nextdir (car dirs))
               (neighbour-dir (cdr dirs))
               (next-win (windmove-find-other-window nextdir win))
               (neighbour1 (windmove-find-other-window neighbour-dir win))
               (neighbour2 (<span style="color: #81A1C1;">if</span> next-win (<span style="color: #81A1C1;">with-selected-window</span> next-win
                                          (windmove-find-other-window
                                           neighbour-dir next-win)))))

          (<span style="color: #81A1C1;">setq</span> done (<span style="color: #81A1C1;">and</span> (eq neighbour1 neighbour2)
                          (not (eq (minibuffer-window) next-win))))
          (<span style="color: #81A1C1;">if</span> done
              (<span style="color: #81A1C1;">let*</span> ((other-buf (window-buffer next-win)))
                (delete-window next-win)
                (<span style="color: #81A1C1;">if</span> (eq nextdir 'right)
                    (split-window-vertically)
                  (split-window-horizontally))
                (set-window-buffer (windmove-find-other-window neighbour-dir)
                                   other-buf))))))))

(<span style="color: #81A1C1;">defun</span> <span style="color: #88C0D0;">insert-newline-after</span> ()
  (<span style="color: #81A1C1;">interactive</span>)
  (<span style="color: #81A1C1;">let</span> ((oldpos (point)))
    (end-of-line)
    (newline-and-indent)
    (goto-char oldpos)))

(<span style="color: #81A1C1;">defun</span> <span style="color: #88C0D0;">set-opacity</span> (value)
  <span style="color: #616e88;">"Sets the opacity of the frame window. 0=transparent/100=opaque"</span>
  (<span style="color: #81A1C1;">interactive</span> <span style="color: #A3BE8C;">"nOpacity Value (0 - 100 opaque): "</span>)
  (set-frame-parameter (selected-frame) 'alpha value))

(<span style="color: #81A1C1;">defun</span> <span style="color: #88C0D0;">dired-at-current</span> ()
  (<span style="color: #81A1C1;">interactive</span>)
  (dired default-directory))

(<span style="color: #81A1C1;">defun</span> <span style="color: #88C0D0;">prev-window</span> ()
  (<span style="color: #81A1C1;">interactive</span>)
  (other-window -1))

<span style="color: #616e88;">;; </span><span style="color: #616e88;">credit: https://gist.github.com/mads379/3402786</span>
<span style="color: #616e88;">;; </span><span style="color: #616e88;">TODO: modeline indication</span>
<span style="color: #616e88;">;; </span><span style="color: #616e88;">TODO: if maximized, prevent other window splitting (use minor mode?)</span>
(<span style="color: #81A1C1;">defun</span> <span style="color: #88C0D0;">toggle-maximize-window</span> ()
  <span style="color: #616e88;">"Maximize window"</span>
  (<span style="color: #81A1C1;">interactive</span>)
  (<span style="color: #81A1C1;">if</span> (= 1 (length (window-list)))
      (jump-to-register '_)
    (<span style="color: #81A1C1;">progn</span>
      (window-configuration-to-register '_)
      (delete-other-windows))))

<span style="color: #616e88;">;; </span><span style="color: #616e88;">credit: https://github.com/abo-abo/hydra/blob/master/hydra-examples.el</span>
(<span style="color: #81A1C1;">defun</span> <span style="color: #88C0D0;">move-splitter-left</span> (arg)
  <span style="color: #616e88;">"Move window splitter left."</span>
  (<span style="color: #81A1C1;">interactive</span> <span style="color: #A3BE8C;">"p"</span>)
  (<span style="color: #81A1C1;">if</span> (<span style="color: #81A1C1;">let</span> ((windmove-wrap-around))
        (windmove-find-other-window 'right))
      (shrink-window-horizontally arg)
    (enlarge-window-horizontally arg)))

<span style="color: #616e88;">;; </span><span style="color: #616e88;">credit: https://github.com/abo-abo/hydra/blob/master/hydra-examples.el</span>
(<span style="color: #81A1C1;">defun</span> <span style="color: #88C0D0;">move-splitter-right</span> (arg)
  <span style="color: #616e88;">"Move window splitter right."</span>
  (<span style="color: #81A1C1;">interactive</span> <span style="color: #A3BE8C;">"p"</span>)
  (<span style="color: #81A1C1;">if</span> (<span style="color: #81A1C1;">let</span> ((windmove-wrap-around))
        (windmove-find-other-window 'right))
      (enlarge-window-horizontally arg)
    (shrink-window-horizontally arg)))

<span style="color: #616e88;">;; </span><span style="color: #616e88;">credit: https://github.com/abo-abo/hydra/blob/master/hydra-examples.el</span>
(<span style="color: #81A1C1;">defun</span> <span style="color: #88C0D0;">move-splitter-up</span> (arg)
  <span style="color: #616e88;">"Move window splitter up."</span>
  (<span style="color: #81A1C1;">interactive</span> <span style="color: #A3BE8C;">"p"</span>)
  (<span style="color: #81A1C1;">if</span> (<span style="color: #81A1C1;">let</span> ((windmove-wrap-around))
        (windmove-find-other-window 'up))
      (enlarge-window arg)
    (shrink-window arg)))

<span style="color: #616e88;">;; </span><span style="color: #616e88;">credit: https://github.com/abo-abo/hydra/blob/master/hydra-examples.el</span>
(<span style="color: #81A1C1;">defun</span> <span style="color: #88C0D0;">move-splitter-down</span> (arg)
  <span style="color: #616e88;">"Move window splitter down."</span>
  (<span style="color: #81A1C1;">interactive</span> <span style="color: #A3BE8C;">"p"</span>)
  (<span style="color: #81A1C1;">if</span> (<span style="color: #81A1C1;">let</span> ((windmove-wrap-around))
        (windmove-find-other-window 'up))
      (shrink-window arg)
    (enlarge-window arg)))

<span style="color: #616e88;">;; </span><span style="color: #616e88;">TODO: set modeline</span>
(<span style="color: #81A1C1;">defun</span> <span style="color: #88C0D0;">toggle-dedicated</span> ()
  (<span style="color: #81A1C1;">interactive</span>)
  (set-window-dedicated-p (selected-window)
                          (not (window-dedicated-p (selected-window)))))

(<span style="color: #81A1C1;">defun</span> <span style="color: #88C0D0;">bury-compile-buffer-if-successful</span> (buffer string)
  <span style="color: #616e88;">"Bury a compilation buffer if succeeded without warnings "</span>
  (<span style="color: #81A1C1;">if</span> (<span style="color: #81A1C1;">and</span>
       (string-match <span style="color: #A3BE8C;">"compilation"</span> (buffer-name buffer))
       (string-match <span style="color: #A3BE8C;">"finished"</span> string)
       (not
        (<span style="color: #81A1C1;">with-current-buffer</span> buffer
          (search-forward <span style="color: #A3BE8C;">"warning"</span> nil t))))
      (run-with-timer 1 nil
                      (<span style="color: #81A1C1;">lambda</span> (buf)
                        (bury-buffer buf)
                        (delete-window (get-buffer-window buf)))
                      buffer)))
(<span style="color: #81A1C1;">defun</span> <span style="color: #88C0D0;">get-current-displays</span> ()
  <span style="color: #616e88;">"Get alist of attributes of displays w/ Emacs buffers."</span>
  (<span style="color: #81A1C1;">require</span> '<span style="color: #81A1C1;">cl</span>)
  (<span style="color: #81A1C1;">interactive</span>)
  (remove-if
   (<span style="color: #81A1C1;">lambda</span> (disp)
     (eq nil (cdr (assoc 'frames disp))))
   (display-monitor-attributes-list)))

(<span style="color: #81A1C1;">defun</span> <span style="color: #88C0D0;">fontify-frame</span> ()
  (<span style="color: #81A1C1;">interactive</span>)
  <span style="color: #A3BE8C;">"Adjusts frame's text size according to current display's</span>
<span style="color: #A3BE8C;">resolution. Prevents illegibly small text on high-resolution</span>
<span style="color: #A3BE8C;">displays and, similarly, impractically large text on</span>
<span style="color: #A3BE8C;">low-resolution displays."</span>
  <span style="color: #616e88;">;; </span><span style="color: #616e88;">FIXME: assumes only one emacs frame on one disp</span>
  (<span style="color: #81A1C1;">let*</span> ((curr-disp (car (jjin-get-current-displays)))
         (disp-width (nth 3 (assoc 'geometry curr-disp)))
         (font-name (<span style="color: #81A1C1;">if</span> (eq system-type 'darwin) <span style="color: #A3BE8C;">"Terminus (TTF)"</span> <span style="color: #A3BE8C;">"Terminus"</span>))
         (font-size (<span style="color: #81A1C1;">if</span> (&gt; disp-width 2000) <span style="color: #A3BE8C;">"12"</span> <span style="color: #A3BE8C;">"04"</span>)))
    (<span style="color: #81A1C1;">if</span> (display-graphic-p)
        (set-frame-parameter nil 'font (string-join `(,font-name ,font-size) <span style="color: #A3BE8C;">" "</span>))))))
</pre>
</div>
</div>
</div>
</div>
