README.org
* General Configurations

  #+BEGIN_SRC emacs-lisp
    (jjin-load-if-exists "~/.secrets.el")

    (setq ring-bell-function 'ignore)

    (setq large-file-warning-threshold nil)

    (setq
      user-mail-address "jjin082693@gmail.com"
      user-full-name  "Jonathan Jin")

    (setq
      inhibit-startup-screen t
      inhibit-startup-message t
      initial-scratch-message nil
      visible-bell t
      use-dialog-box nil)

    (setq-default
      fill-column 80
      indent-tabs-mode nil
      tab-width 4)

    (setq next-line-add-newlines t)

    (setq scroll-step 1
      scroll-conservatively 10000
      scroll-margin 3)

    (fset 'yes-or-no-p 'y-or-n-p)

    (if window-system
        (progn
          (tool-bar-mode     0)
          (scroll-bar-mode   0)
          (menu-bar-mode     0)
          (line-number-mode  0)))

    (blink-cursor-mode 0)

    (global-auto-revert-mode)
    (setq auto-revert-remote-files t)

    (global-hl-line-mode 1)
    (column-number-mode  1)
    (show-paren-mode     1)

    (electric-pair-mode)

    (delete-selection-mode +1)

    (add-hook 'prog-mode-hook 'turn-on-auto-fill)
    (add-hook 'text-mode-hook 'turn-on-auto-fill)

    (fringe-mode '(4 . 0))

    (with-eval-after-load 'dired
      (define-key dired-mode-map (kbd "RET") 'dired-find-alternate-file))

    (put 'dired-find-alternate-file 'disabled nil)

    (setq echo-keystrokes 0)

    (setq image-dired-external-viewer "feh")

    (setq term-ansi-default-program (getenv "SHELL"))

    (setq enable-remote-dir-locals t)

    (defconst custom-file-path "~/.emacs-custom.el")
    (if (file-exists-p custom-file-path)
        (load (setq custom-file custom-file-path)))
  #+END_SRC

** Scratch Org-mode

   I spend more time in Org-mode than I do writing Elisp.

   #+BEGIN_SRC emacs-lisp
     (setq initial-major-mode 'org-mode)
   #+END_SRC

** Appearance

*** Themes

    #+BEGIN_SRC emacs-lisp

      (use-package gotham-theme
        :if window-system
        :disabled t
        :config
        (load-theme 'gotham t)) 

      (use-package nord-theme
        :if window-system
        :straight (:host github :repo "arcticicestudio/nord-emacs" :branch "develop")
        :init
        (setq nord-comment-brightness 10)
        :config
        (load-theme 'nord t))
    #+END_SRC

*** General

    #+BEGIN_SRC emacs-lisp
      (setq-default x-stretch-cursor t)

      (setq custom-safe-themes t)

      (set-frame-font
       (cond 
        ((string= "gnu/linux" system-type) "-xos4-terminus-medium-r-normal--28-*-72-72-c-140-iso10646-1")
        ((string= "darwin" system-type) "Terminus (TTF) 16")
         (t "Terminus 16")))

      (when (functionp 'set-fontset-font)
        (set-fontset-font "fontset-default"
                          'unicode
                          (font-spec :family "DejaVu Sans Mono")))

      (jjin-set-opacity 90)
    #+END_SRC

** Environment-specific

*** Mac

    #+BEGIN_SRC emacs-lisp
      (when (eq system-type 'darwin)
        (setq mac-command-modifier 'meta)
        (setq mac-right-command-modifier 'meta)
        (setq mac-option-modifier 'super)
        (setq mac-right-option-modifier 'super)
        (setq system-uses-terminfo nil))
    #+END_SRC

    =compilation-mode= invokes shell in a non-interactive shell, which means
    that configurations in =.bashrc= do not get surfaced. This can cause
    complications in cases where, for instance, successful compilation is
    predicated on conditions set within a provisioned profile file that I do not
    control. When Bash is started non-interactively, it looks for =BASH_ENV= in
    the environment, expands its value if it appears there, and uses the
    expanded value as the name of a file to read and execute. As such, we set
    that environment value to our startup file here.

    #+begin_src emacs-lisp
      (when (eq system-type 'darwin) (setenv "BASH_ENV" "$HOME/.bashrc"))
    #+end_src
    

** Server

   Make sure =EDITOR= and/or =VISUAL= is/are set to =emacsclient=.

   #+BEGIN_SRC emacs-lisp
     (use-package server
       :config
       (unless (server-running-p) (server-start)))
   #+END_SRC
   
** "Launcher"

   I like to keep several functions within Emacs within a short key press away;
   these tend to correspond to "applications" such as email, RSS, Slack,
   etc.

   The following allows me to emulate [[https://en.wikipedia.org/wiki/Spotlight_(software)][macOS's Spotlight functionality]] in a
   lightweight manner, to put these regularly used "applications" within easy
   reach.

   #+begin_src emacs-lisp
     (use-package helm-exec
       :after helm
       :straight (:repo "https://github.com/jinnovation/helm-exec.git")
       :bind (("C-c e" . helm-exec-execute)))
   #+end_src
  
** Nested .dir-locals.el

   #+begin_src emacs-lisp
     (use-package nested-dir-local
       :straight (:repo "git@github.com:jinnovation/nested-dir-locals.el.git"))
   #+end_src
* Keys

