index.html

<div id="outline-container-orgc8ee4cf" class="outline-2">
<h2 id="orgc8ee4cf"><span class="section-number-2">2</span> General Configurations</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(jjin-load-if-exists <span style="color: #A3BE8C;">"~/.secrets.el"</span>)

(<span style="color: #81A1C1;">setq</span> ring-bell-function 'ignore)

(<span style="color: #81A1C1;">setq</span> large-file-warning-threshold nil)

(<span style="color: #81A1C1;">setq</span>
  user-mail-address <span style="color: #A3BE8C;">"jjin082693@gmail.com"</span>
  user-full-name  <span style="color: #A3BE8C;">"Jonathan Jin"</span>)

(<span style="color: #81A1C1;">setq</span>
  inhibit-startup-screen t
  inhibit-startup-message t
  initial-scratch-message nil
  visible-bell t
  use-dialog-box nil)

(<span style="color: #81A1C1;">setq-default</span>
  fill-column 80
  indent-tabs-mode nil
  tab-width 4)

(<span style="color: #81A1C1;">setq</span> next-line-add-newlines t)

(<span style="color: #81A1C1;">setq</span> scroll-step 1
  scroll-conservatively 10000
  scroll-margin 3)

(fset 'yes-or-no-p 'y-or-n-p)

(<span style="color: #81A1C1;">if</span> window-system
    (<span style="color: #81A1C1;">progn</span>
      (tool-bar-mode     0)
      (scroll-bar-mode   0)
      (menu-bar-mode     0)
      (line-number-mode  0)))

(blink-cursor-mode 0)

(global-auto-revert-mode)
(<span style="color: #81A1C1;">setq</span> auto-revert-remote-files t)

(global-hl-line-mode 1)
(column-number-mode  1)
(show-paren-mode     1)

(electric-pair-mode)

(delete-selection-mode +1)

(add-hook 'prog-mode-hook 'turn-on-auto-fill)
(add-hook 'text-mode-hook 'turn-on-auto-fill)

(fringe-mode '(4 . 0))

(<span style="color: #81A1C1;">with-eval-after-load</span> 'dired
  (define-key dired-mode-map (kbd <span style="color: #A3BE8C;">"RET"</span>) 'dired-find-alternate-file))

(put 'dired-find-alternate-file 'disabled nil)

(<span style="color: #81A1C1;">setq</span> echo-keystrokes 0)

(<span style="color: #81A1C1;">setq</span> image-dired-external-viewer <span style="color: #A3BE8C;">"feh"</span>)

(<span style="color: #81A1C1;">setq</span> term-ansi-default-program (getenv <span style="color: #A3BE8C;">"SHELL"</span>))

(<span style="color: #81A1C1;">setq</span> enable-remote-dir-locals t)

(<span style="color: #81A1C1;">defconst</span> <span style="color: #D8DEE9;">custom-file-path</span> <span style="color: #A3BE8C;">"~/.emacs-custom.el"</span>)
(<span style="color: #81A1C1;">if</span> (file-exists-p custom-file-path)
    (load (<span style="color: #81A1C1;">setq</span> custom-file custom-file-path)))
</pre>
</div>
</div>

<div id="outline-container-org7ed58a3" class="outline-3">
<h3 id="org7ed58a3"><span class="section-number-3">2.1</span> Scratch Org-mode</h3>
<div class="outline-text-3" id="text-2-1">
<p>
I spend more time in Org-mode than I do writing Elisp.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #81A1C1;">setq</span> initial-major-mode 'org-mode)
</pre>
</div>
</div>
</div>

<div id="outline-container-org516b304" class="outline-3">
<h3 id="org516b304"><span class="section-number-3">2.2</span> Appearance</h3>
<div class="outline-text-3" id="text-2-2">
</div>
<div id="outline-container-orga9a836a" class="outline-4">
<h4 id="orga9a836a"><span class="section-number-4">2.2.1</span> Themes</h4>
<div class="outline-text-4" id="text-2-2-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
(<span style="color: #81A1C1;">use-package</span> <span style="color: #81A1C1;">gotham-theme</span>
  <span style="color: #81A1C1;">:if</span> window-system
  <span style="color: #81A1C1;">:disabled</span> t
  <span style="color: #81A1C1;">:config</span>
  (load-theme 'gotham t)) 

(<span style="color: #81A1C1;">use-package</span> <span style="color: #81A1C1;">nord-theme</span>
  <span style="color: #81A1C1;">:if</span> window-system
  <span style="color: #81A1C1;">:straight</span> (<span style="color: #81A1C1;">:host</span> github <span style="color: #81A1C1;">:repo</span> <span style="color: #A3BE8C;">"arcticicestudio/nord-emacs"</span> <span style="color: #81A1C1;">:branch</span> <span style="color: #A3BE8C;">"develop"</span>)
  <span style="color: #81A1C1;">:init</span>
  (<span style="color: #81A1C1;">setq</span> nord-comment-brightness 10)
  <span style="color: #81A1C1;">:config</span>
  (load-theme 'nord t))
</pre>
</div>
</div>
</div>

<div id="outline-container-org5b810f4" class="outline-4">
<h4 id="org5b810f4"><span class="section-number-4">2.2.2</span> General</h4>
<div class="outline-text-4" id="text-2-2-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #81A1C1;">setq-default</span> x-stretch-cursor t)

(<span style="color: #81A1C1;">setq</span> custom-safe-themes t)

(set-frame-font
 (<span style="color: #81A1C1;">cond</span> 
  ((string= <span style="color: #A3BE8C;">"gnu/linux"</span> system-type) <span style="color: #A3BE8C;">"-xos4-terminus-medium-r-normal--28-*-72-72-c-140-iso10646-1"</span>)
  ((string= <span style="color: #A3BE8C;">"darwin"</span> system-type) <span style="color: #A3BE8C;">"Terminus (TTF) 16"</span>)
   (t <span style="color: #A3BE8C;">"Terminus 16"</span>)))

(<span style="color: #81A1C1;">when</span> (functionp 'set-fontset-font)
  (set-fontset-font <span style="color: #A3BE8C;">"fontset-default"</span>
                    'unicode
                    (font-spec <span style="color: #81A1C1;">:family</span> <span style="color: #A3BE8C;">"DejaVu Sans Mono"</span>)))

(jjin-set-opacity 90)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org2139ec7" class="outline-3">
<h3 id="org2139ec7"><span class="section-number-3">2.3</span> Environment-specific</h3>
<div class="outline-text-3" id="text-2-3">
</div>
<div id="outline-container-org7b3dccd" class="outline-4">
<h4 id="org7b3dccd"><span class="section-number-4">2.3.1</span> Mac</h4>
<div class="outline-text-4" id="text-2-3-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #81A1C1;">when</span> (eq system-type 'darwin)
  (<span style="color: #81A1C1;">setq</span> mac-command-modifier 'meta)
  (<span style="color: #81A1C1;">setq</span> mac-right-command-modifier 'meta)
  (<span style="color: #81A1C1;">setq</span> mac-option-modifier 'super)
  (<span style="color: #81A1C1;">setq</span> mac-right-option-modifier 'super)
  (<span style="color: #81A1C1;">setq</span> system-uses-terminfo nil))
</pre>
</div>

<p>
<code>compilation-mode</code> invokes shell in a non-interactive shell, which means
that configurations in <code>.bashrc</code> do not get surfaced. This can cause
complications in cases where, for instance, successful compilation is
predicated on conditions set within a provisioned profile file that I do not
control. When Bash is started non-interactively, it looks for <code>BASH_ENV</code> in
the environment, expands its value if it appears there, and uses the
expanded value as the name of a file to read and execute. As such, we set
that environment value to our startup file here.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #81A1C1;">when</span> (eq system-type 'darwin) (setenv <span style="color: #A3BE8C;">"BASH_ENV"</span> <span style="color: #A3BE8C;">"$HOME/.bashrc"</span>))
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-org8c6059e" class="outline-3">
<h3 id="org8c6059e"><span class="section-number-3">2.4</span> Server</h3>
<div class="outline-text-3" id="text-2-4">
<p>
Make sure <code>EDITOR</code> and/or <code>VISUAL</code> is/are set to <code>emacsclient</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #81A1C1;">use-package</span> <span style="color: #81A1C1;">server</span>
  <span style="color: #81A1C1;">:config</span>
  (<span style="color: #81A1C1;">unless</span> (server-running-p) (server-start)))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgcff0145" class="outline-3">
<h3 id="orgcff0145"><span class="section-number-3">2.5</span> &ldquo;Launcher&rdquo;</h3>
<div class="outline-text-3" id="text-2-5">
<p>
I like to keep several functions within Emacs within a short key press away;
these tend to correspond to &ldquo;applications&rdquo; such as email, RSS, Slack,
etc.
</p>

<p>
The following allows me to emulate <a href="https://en.wikipedia.org/wiki/Spotlight_(software)">macOS&rsquo;s Spotlight functionality</a> in a
lightweight manner, to put these regularly used &ldquo;applications&rdquo; within easy
reach.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #81A1C1;">use-package</span> <span style="color: #81A1C1;">helm-exec</span>
  <span style="color: #81A1C1;">:after</span> helm
  <span style="color: #81A1C1;">:straight</span> (<span style="color: #81A1C1;">:repo</span> <span style="color: #A3BE8C;">"https://github.com/jinnovation/helm-exec.git"</span>)
  <span style="color: #81A1C1;">:bind</span> ((<span style="color: #A3BE8C;">"C-c e"</span> . helm-exec-execute)))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgabd8ccc" class="outline-3">
<h3 id="orgabd8ccc"><span class="section-number-3">2.6</span> Nested .dir-locals.el</h3>
<div class="outline-text-3" id="text-2-6">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #81A1C1;">use-package</span> <span style="color: #81A1C1;">nested-dir-local</span>
  <span style="color: #81A1C1;">:straight</span> (<span style="color: #81A1C1;">:repo</span> <span style="color: #A3BE8C;">"git@github.com:jinnovation/nested-dir-locals.el.git"</span>))
</pre>
</div>
</div>
</div>
</div>
