index.html
<div id="outline-container-org0a25365" class="outline-2">
<h2 id="org0a25365"><span class="section-number-2">3</span> Keys</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org270c1a9" class="outline-3">
<h3 id="org270c1a9"><span class="section-number-3">3.1</span> Personal maps</h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(define-prefix-command 'jjin-vc-map)
(<span style="color: #81A1C1;">bind-key</span> <span style="color: #A3BE8C;">"C-c v"</span> 'jjin-vc-map)

(define-prefix-command 'jjin-chat-map)
(<span style="color: #81A1C1;">bind-key</span> <span style="color: #A3BE8C;">"C-c i"</span> 'jjin-chat-map)

(define-prefix-command 'jjin-comment-map)
(<span style="color: #81A1C1;">bind-key</span> <span style="color: #A3BE8C;">"C-c c"</span> 'jjin-comment-map)

(define-prefix-command 'jjin-term-map)
(<span style="color: #81A1C1;">bind-key</span> <span style="color: #A3BE8C;">"C-c t"</span> 'jjin-term-map)

(define-prefix-command 'jjin-buffer-map)
(<span style="color: #81A1C1;">bind-key</span> <span style="color: #A3BE8C;">"C-c b"</span> 'jjin-buffer-map)
</pre>
</div>
</div>
</div>

<div id="outline-container-org15a8c0a" class="outline-3">
<h3 id="org15a8c0a"><span class="section-number-3">3.2</span> Keybindings</h3>
<div class="outline-text-3" id="text-3-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #81A1C1;">bind-keys</span> <span style="color: #81A1C1;">:map</span> global-map
           (<span style="color: #A3BE8C;">"C-x k"</span>              . jjin-kill-current-buffer)
           (<span style="color: #A3BE8C;">"RET"</span>                . newline-and-indent))

(<span style="color: #81A1C1;">unbind-key</span> <span style="color: #A3BE8C;">"&lt;menu&gt;"</span>)
(<span style="color: #81A1C1;">unbind-key</span> <span style="color: #A3BE8C;">"M-`"</span>)
(<span style="color: #81A1C1;">unbind-key</span> <span style="color: #A3BE8C;">"C-c C-w"</span>)
(<span style="color: #81A1C1;">unbind-key</span> <span style="color: #A3BE8C;">"C-x C-n"</span>)      <span style="color: #616e88;">; </span><span style="color: #616e88;">set-goal-column</span>

(<span style="color: #81A1C1;">unbind-key</span> <span style="color: #A3BE8C;">"&lt;f10&gt;"</span>)
(<span style="color: #81A1C1;">unbind-key</span> <span style="color: #A3BE8C;">"&lt;f11&gt;"</span>)
(<span style="color: #81A1C1;">unbind-key</span> <span style="color: #A3BE8C;">"M-&lt;f10&gt;"</span>)
(<span style="color: #81A1C1;">unbind-key</span> <span style="color: #A3BE8C;">"&lt;escape&gt; &lt;f10&gt;"</span>)

(<span style="color: #81A1C1;">bind-keys</span> <span style="color: #81A1C1;">:map</span> jjin-buffer-map
           (<span style="color: #A3BE8C;">"r"</span> . rename-buffer))

(<span style="color: #81A1C1;">bind-keys</span> <span style="color: #81A1C1;">:map</span> global-map
           (<span style="color: #A3BE8C;">"&lt;s-backspace&gt;"</span> . backward-kill-word))

(<span style="color: #81A1C1;">bind-keys</span> <span style="color: #81A1C1;">:map</span> global-map
           (<span style="color: #A3BE8C;">"s-s"</span> . save-buffer))

(<span style="color: #81A1C1;">use-package</span> <span style="color: #81A1C1;">org-src</span>
  <span style="color: #81A1C1;">:bind</span> ((<span style="color: #A3BE8C;">"s-s"</span> . org-edit-src-save)))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #81A1C1;">use-package</span> <span style="color: #81A1C1;">hydra</span>
  <span style="color: #81A1C1;">:commands</span> defhydra
  <span style="color: #81A1C1;">:straight</span> t
  <span style="color: #81A1C1;">:config</span>
  (<span style="color: #81A1C1;">defhydra</span> jjin-hydra-window (global-map <span style="color: #A3BE8C;">"C-c w"</span>)
    <span style="color: #616e88;">"Commands relating to window manipulation"</span>
    (<span style="color: #A3BE8C;">"h"</span> windmove-left <span style="color: #A3BE8C;">"move left"</span>)
    (<span style="color: #A3BE8C;">"l"</span> windmove-right <span style="color: #A3BE8C;">"move right"</span>)
    (<span style="color: #A3BE8C;">"j"</span> windmove-down <span style="color: #A3BE8C;">"move down"</span>)
    (<span style="color: #A3BE8C;">"k"</span> windmove-up <span style="color: #A3BE8C;">"move up"</span>)
    (<span style="color: #A3BE8C;">"q"</span> delete-window <span style="color: #A3BE8C;">"delete window"</span>)
    (<span style="color: #A3BE8C;">"Q"</span> kill-buffer-and-window <span style="color: #A3BE8C;">"kill buffer, delete window"</span>)
    (<span style="color: #A3BE8C;">"H"</span> jjin-move-splitter-left <span style="color: #A3BE8C;">"move splitter left"</span>)
    (<span style="color: #A3BE8C;">"L"</span> jjin-move-splitter-right <span style="color: #A3BE8C;">"move splitter right"</span>)
    (<span style="color: #A3BE8C;">"J"</span> jjin-move-splitter-down <span style="color: #A3BE8C;">"move splitter down"</span>)
    (<span style="color: #A3BE8C;">"K"</span> jjin-move-splitter-up <span style="color: #A3BE8C;">"move splitter up"</span>)
    (<span style="color: #A3BE8C;">"b"</span> balance-windows)
    (<span style="color: #A3BE8C;">"|"</span> jjin-window-toggle-split-direction)
    (<span style="color: #A3BE8C;">"s"</span> split-window-below <span style="color: #A3BE8C;">"split window (below)"</span>)
    (<span style="color: #A3BE8C;">"v"</span> split-window-right <span style="color: #A3BE8C;">"split window (right)"</span>)
    (<span style="color: #A3BE8C;">";"</span> ace-window <span style="color: #A3BE8C;">"select window"</span> <span style="color: #81A1C1;">:exit</span> t)))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org41ab046" class="outline-2">
<h2 id="org41ab046"><span class="section-number-2">4</span> Development Environments</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orge2b1bc6" class="outline-3">
<h3 id="orge2b1bc6"><span class="section-number-3">4.1</span> General Style</h3>
<div class="outline-text-3" id="text-4-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(c-set-offset 'arglist-intro '+)
(c-set-offset 'arglist-close 0)
</pre>
</div>
</div>
</div>

<div id="outline-container-org12b0a4d" class="outline-3">
<h3 id="org12b0a4d"><span class="section-number-3">4.2</span> Aurora</h3>
<div class="outline-text-3" id="text-4-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #81A1C1;">use-package</span> <span style="color: #81A1C1;">aurora-config-mode</span>
  <span style="color: #81A1C1;">:straight</span> t)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgeca1b6a" class="outline-3">
<h3 id="orgeca1b6a"><span class="section-number-3">4.3</span> C/C++</h3>
<div class="outline-text-3" id="text-4-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #81A1C1;">setq</span> c-block-comment-prefix <span style="color: #A3BE8C;">"* "</span>)

(<span style="color: #81A1C1;">defvaralias</span> '<span style="color: #D8DEE9;">c-basic-offset</span> 'tab-width)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #81A1C1;">use-package</span> <span style="color: #81A1C1;">irony</span>
  <span style="color: #81A1C1;">:disabled</span> t
  <span style="color: #81A1C1;">:commands</span> irony-mode
  <span style="color: #81A1C1;">:init</span>
  (add-hook 'c-mode-hook 'irony-mode)
  (add-hook 'c++-mode-hook 'irony-mode)
  <span style="color: #81A1C1;">:config</span>
  (<span style="color: #81A1C1;">use-package</span> <span style="color: #81A1C1;">flycheck-irony</span>
    <span style="color: #81A1C1;">:config</span>
    (add-hook 'flycheck-mode-hook 'flycheck-irony-setup)))

(<span style="color: #81A1C1;">use-package</span> <span style="color: #81A1C1;">company-irony</span>
  <span style="color: #81A1C1;">:disabled</span> t
  <span style="color: #81A1C1;">:config</span>
  (add-to-list 'company-backends 'company-irony))

(<span style="color: #81A1C1;">use-package</span> <span style="color: #81A1C1;">clang-format</span>
  <span style="color: #81A1C1;">:disabled</span> t
  <span style="color: #81A1C1;">:config</span>
  (add-to-list 'auto-mode-alist '(<span style="color: #A3BE8C;">"\\.clang-format$"</span> . yaml-mode)))
</pre>
</div>
</div>
</div>

<div id="outline-container-org1596cf8" class="outline-3">
<h3 id="org1596cf8"><span class="section-number-3">4.4</span> Go</h3>
<div class="outline-text-3" id="text-4-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #81A1C1;">use-package</span> <span style="color: #81A1C1;">go-mode</span>
  <span style="color: #81A1C1;">:mode</span> <span style="color: #A3BE8C;">"\\.go$"</span>
  <span style="color: #81A1C1;">:straight</span> t

  <span style="color: #81A1C1;">:init</span>
  (<span style="color: #81A1C1;">if</span> (executable-find <span style="color: #A3BE8C;">"goimports"</span>)
      (<span style="color: #81A1C1;">setq</span> gofmt-command <span style="color: #A3BE8C;">"goimports"</span>)
    (message <span style="color: #A3BE8C;">"Goimports not found; using default `</span><span style="color: #81A1C1;">gofmt-command</span><span style="color: #A3BE8C;">'"</span>))

  <span style="color: #81A1C1;">:config</span>
  (add-hook 'before-save-hook 'gofmt-before-save))

(<span style="color: #81A1C1;">use-package</span> <span style="color: #81A1C1;">company-go</span>
  <span style="color: #81A1C1;">:after</span> go
  <span style="color: #81A1C1;">:disabled</span> t)

(<span style="color: #81A1C1;">use-package</span> <span style="color: #81A1C1;">go-guru</span>
  <span style="color: #81A1C1;">:after</span> go
  <span style="color: #81A1C1;">:straight</span> t)
</pre>
</div>
</div>
</div>

<div id="outline-container-orge16f6a3" class="outline-3">
<h3 id="orge16f6a3"><span class="section-number-3">4.5</span> Lisp</h3>
<div class="outline-text-3" id="text-4-5">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(add-to-list 'auto-mode-alist '(<span style="color: #A3BE8C;">"emacs$"</span> . emacs-lisp-mode))
(add-to-list 'auto-mode-alist '(<span style="color: #A3BE8C;">"Cask"</span> . emacs-lisp-mode))
</pre>
</div>
</div>
</div>

<div id="outline-container-org355adee" class="outline-3">
<h3 id="org355adee"><span class="section-number-3">4.6</span> Javascript</h3>
<div class="outline-text-3" id="text-4-6">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #81A1C1;">defvaralias</span> '<span style="color: #D8DEE9;">js-indent-level</span> 'tab-width)

(<span style="color: #81A1C1;">use-package</span> <span style="color: #81A1C1;">js2-mode</span>
  <span style="color: #81A1C1;">:mode</span> ((<span style="color: #A3BE8C;">"\\.js$"</span> . js2-mode)
         (<span style="color: #A3BE8C;">"\\.jsx$"</span> . js2-jsx-mode))
  <span style="color: #81A1C1;">:straight</span> t)

(<span style="color: #81A1C1;">use-package</span> <span style="color: #81A1C1;">json-mode</span>
  <span style="color: #81A1C1;">:straight</span> t)
</pre>
</div>
</div>
</div>
