README.org
** LaTeX

   #+BEGIN_SRC emacs-lisp
     ;; sets latex-mode to compile w/ pdflatex by default
     (setq TeX-PDF-mode t
         TeX-parse-self t
         TeX-newline-function 'reindent-then-newline-and-indent)

     (eval-after-load "tex"
         '(setcdr (assoc "LaTeX" TeX-command-list)
              '("%`%l%(mode) -shell-escape%' %t"
                   TeX-run-TeX nil (latex-mode doctex-mode) :help "Run LaTeX")))

     ;; latex-mode-specific hooks (because latex-mode is not derived from prog-mode)
     (add-hook 'LaTeX-mode-hook
         (lambda ()
             (TeX-fold-mode 1)
             (auto-fill-mode)
             (add-to-list 'TeX-command-list '("XeLaTeX" "%`xelatex%(mode)%' %t"
                                                 TeX-run-TeX nil t))))
   #+END_SRC

** zsh

   #+BEGIN_SRC emacs-lisp
     (add-to-list 'auto-mode-alist '("zshrc$" . sh-mode))
     (add-to-list 'auto-mode-alist '("\\.zsh$" . sh-mode))
   #+END_SRC

** Haskell

   #+BEGIN_SRC emacs-lisp
     (use-package haskell-mode
       :disabled t
       :config
       (add-hook 'haskell-mode-hook 'turn-on-haskell-indent))
   #+END_SRC

** Pants

   #+begin_src emacs-lisp
     (use-package pants-build-mode
       :mode ("BUILD$")
       :straight (:repo "git@github.com:jinnovation/pants-build-mode.git"))
   #+end_src
   
** Ruby

   #+BEGIN_SRC emacs-lisp
     (use-package enh-ruby-mode
       :disabled t
       :mode ("Gemfile" "Guardfile")
       :config
       (defvaralias 'ruby-indent-level 'tab-width))

     (use-package ruby-end
       :disabled t
       :config
       (add-hook 'ruby-mode-hook 'ruby-end-mode))
   #+END_SRC

** SQL

   #+BEGIN_SRC emacs-lisp
     (setq sql-mysql-options '("--local-infile"))

     (add-hook 'sql-interactive-mode-hook
               (lambda ()
                 (toggle-truncate-lines t)))
   #+END_SRC

** Thrift

   #+BEGIN_SRC emacs-lisp
     (use-package thrift
       :straight t
       :if (eq system-type 'darwin) ;; only need this on work computer
       :config
       (add-hook 'thrift-mode-hook
                 (lambda ()
                   (setq comment-start "//")
                   (setq comment-end ""))))
   #+END_SRC

** Octave

   #+BEGIN_SRC emacs-lisp
     (use-package octave
       :mode ("\\.m$" . octave-mode)
       :interpreter ("octave" . octave-mode)
       :config
       (with-eval-after-load 'evil
           (progn
             (add-to-list 'evil-emacs-state-modes 'octave-help-mode)
             (add-to-list 'evil-emacs-state-modes 'inferior-octave-mode)))

       (setq inferior-octave-program "octave-cli")
       (setq inferior-octave-prompt ">> ")
       (setq inferior-octave-dynamic-complete-functions '(comint-filename-completion))

       (setq inferior-octave-startup-args '("-i" "--line-editing" "-q" "--traditional")))
   #+END_SRC

** Matlab

   #+BEGIN_SRC emacs-lisp
     (use-package matlab
       :disabled t
       :init
       (setq matlab-shell-command-switches '("-nodesktop")))
   #+END_SRC

** Python

   #+BEGIN_SRC emacs-lisp
     (setq python-fill-docstring-style 'pep-257)

     (use-package pyvenv
       :straight t)

     (use-package elpy
       :straight t
       :init
       (setq elpy-modules '(elpy-module-company
                            elpy-module-eldoc
                            elpy-module-flymake
                            elpy-module-pyvenv
                            elpy-module-yasnippet
                            elpy-module-sane-defaults))
       (elpy-enable))
   #+END_SRC

** Emacs Lisp

   #+BEGIN_SRC emacs-lisp
     (use-package elisp-mode
       :bind (("C-c C-f" . find-function)
              ("C-c C-v" . find-variable)))
   #+END_SRC

** Markdown

   #+BEGIN_SRC emacs-lisp
     (use-package markdown-mode
       :straight t
       :mode "\\.md$"
       :init
       (setq markdown-asymmetric-header t)
       :config
       (add-hook 'markdown-mode-hook 'auto-fill-mode))

     (use-package markdown-mode+
       :straight t
       :after markdown-mode)
   #+END_SRC

** YAML

   #+BEGIN_SRC emacs-lisp
     (use-package yaml-mode
       :straight t
       :mode "\\.yaml$")
   #+END_SRC

