index.html

<div id="outline-container-orgfb90b1a" class="outline-3">
<h3 id="orgfb90b1a"><span class="section-number-3">4.7</span> LaTeX</h3>
<div class="outline-text-3" id="text-4-7">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #616e88;">;; </span><span style="color: #616e88;">sets latex-mode to compile w/ pdflatex by default</span>
(<span style="color: #81A1C1;">setq</span> TeX-PDF-mode t
    TeX-parse-self t
    TeX-newline-function 'reindent-then-newline-and-indent)

(eval-after-load <span style="color: #A3BE8C;">"tex"</span>
    '(setcdr (assoc <span style="color: #A3BE8C;">"LaTeX"</span> TeX-command-list)
         '(<span style="color: #A3BE8C;">"%`%l%(mode) -shell-escape%' %t"</span>
              TeX-run-TeX nil (latex-mode doctex-mode) <span style="color: #81A1C1;">:help</span> <span style="color: #A3BE8C;">"Run LaTeX"</span>)))

<span style="color: #616e88;">;; </span><span style="color: #616e88;">latex-mode-specific hooks (because latex-mode is not derived from prog-mode)</span>
(add-hook 'LaTeX-mode-hook
    (<span style="color: #81A1C1;">lambda</span> ()
        (TeX-fold-mode 1)
        (auto-fill-mode)
        (add-to-list 'TeX-command-list '(<span style="color: #A3BE8C;">"XeLaTeX"</span> <span style="color: #A3BE8C;">"%`xelatex%(mode)%' %t"</span>
                                            TeX-run-TeX nil t))))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb1a7827" class="outline-3">
<h3 id="orgb1a7827"><span class="section-number-3">4.8</span> zsh</h3>
<div class="outline-text-3" id="text-4-8">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(add-to-list 'auto-mode-alist '(<span style="color: #A3BE8C;">"zshrc$"</span> . sh-mode))
(add-to-list 'auto-mode-alist '(<span style="color: #A3BE8C;">"\\.zsh$"</span> . sh-mode))
</pre>
</div>
</div>
</div>

<div id="outline-container-orga8eb3c9" class="outline-3">
<h3 id="orga8eb3c9"><span class="section-number-3">4.9</span> Haskell</h3>
<div class="outline-text-3" id="text-4-9">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #81A1C1;">use-package</span> <span style="color: #81A1C1;">haskell-mode</span>
  <span style="color: #81A1C1;">:disabled</span> t
  <span style="color: #81A1C1;">:config</span>
  (add-hook 'haskell-mode-hook 'turn-on-haskell-indent))
</pre>
</div>
</div>
</div>

<div id="outline-container-org2505515" class="outline-3">
<h3 id="org2505515"><span class="section-number-3">4.10</span> Pants</h3>
<div class="outline-text-3" id="text-4-10">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #81A1C1;">use-package</span> <span style="color: #81A1C1;">pants-build-mode</span>
  <span style="color: #81A1C1;">:mode</span> (<span style="color: #A3BE8C;">"BUILD$"</span>)
  <span style="color: #81A1C1;">:straight</span> (<span style="color: #81A1C1;">:repo</span> <span style="color: #A3BE8C;">"git@github.com:jinnovation/pants-build-mode.git"</span>))
</pre>
</div>
</div>
</div>

<div id="outline-container-org583d919" class="outline-3">
<h3 id="org583d919"><span class="section-number-3">4.11</span> Ruby</h3>
<div class="outline-text-3" id="text-4-11">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #81A1C1;">use-package</span> <span style="color: #81A1C1;">enh-ruby-mode</span>
  <span style="color: #81A1C1;">:disabled</span> t
  <span style="color: #81A1C1;">:mode</span> (<span style="color: #A3BE8C;">"Gemfile"</span> <span style="color: #A3BE8C;">"Guardfile"</span>)
  <span style="color: #81A1C1;">:config</span>
  (<span style="color: #81A1C1;">defvaralias</span> '<span style="color: #D8DEE9;">ruby-indent-level</span> 'tab-width))

(<span style="color: #81A1C1;">use-package</span> <span style="color: #81A1C1;">ruby-end</span>
  <span style="color: #81A1C1;">:disabled</span> t
  <span style="color: #81A1C1;">:config</span>
  (add-hook 'ruby-mode-hook 'ruby-end-mode))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf8cd0b1" class="outline-3">
<h3 id="orgf8cd0b1"><span class="section-number-3">4.12</span> SQL</h3>
<div class="outline-text-3" id="text-4-12">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #81A1C1;">setq</span> sql-mysql-options '(<span style="color: #A3BE8C;">"--local-infile"</span>))

(add-hook 'sql-interactive-mode-hook
          (<span style="color: #81A1C1;">lambda</span> ()
            (toggle-truncate-lines t)))
</pre>
</div>
</div>
</div>

<div id="outline-container-org605bf23" class="outline-3">
<h3 id="org605bf23"><span class="section-number-3">4.13</span> Thrift</h3>
<div class="outline-text-3" id="text-4-13">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #81A1C1;">use-package</span> <span style="color: #81A1C1;">thrift</span>
  <span style="color: #81A1C1;">:straight</span> t
  <span style="color: #81A1C1;">:if</span> (eq system-type 'darwin) <span style="color: #616e88;">;; </span><span style="color: #616e88;">only need this on work computer</span>
  <span style="color: #81A1C1;">:config</span>
  (add-hook 'thrift-mode-hook
            (<span style="color: #81A1C1;">lambda</span> ()
              (<span style="color: #81A1C1;">setq</span> comment-start <span style="color: #A3BE8C;">"//"</span>)
              (<span style="color: #81A1C1;">setq</span> comment-end <span style="color: #A3BE8C;">""</span>))))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf5f6933" class="outline-3">
<h3 id="orgf5f6933"><span class="section-number-3">4.14</span> Octave</h3>
<div class="outline-text-3" id="text-4-14">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #81A1C1;">use-package</span> <span style="color: #81A1C1;">octave</span>
  <span style="color: #81A1C1;">:mode</span> (<span style="color: #A3BE8C;">"\\.m$"</span> . octave-mode)
  <span style="color: #81A1C1;">:interpreter</span> (<span style="color: #A3BE8C;">"octave"</span> . octave-mode)
  <span style="color: #81A1C1;">:config</span>
  (<span style="color: #81A1C1;">with-eval-after-load</span> 'evil
      (<span style="color: #81A1C1;">progn</span>
        (add-to-list 'evil-emacs-state-modes 'octave-help-mode)
        (add-to-list 'evil-emacs-state-modes 'inferior-octave-mode)))

  (<span style="color: #81A1C1;">setq</span> inferior-octave-program <span style="color: #A3BE8C;">"octave-cli"</span>)
  (<span style="color: #81A1C1;">setq</span> inferior-octave-prompt <span style="color: #A3BE8C;">"&gt;&gt; "</span>)
  (<span style="color: #81A1C1;">setq</span> inferior-octave-dynamic-complete-functions '(comint-filename-completion))

  (<span style="color: #81A1C1;">setq</span> inferior-octave-startup-args '(<span style="color: #A3BE8C;">"-i"</span> <span style="color: #A3BE8C;">"--line-editing"</span> <span style="color: #A3BE8C;">"-q"</span> <span style="color: #A3BE8C;">"--traditional"</span>)))
</pre>
</div>
</div>
</div>

<div id="outline-container-orge23d01f" class="outline-3">
<h3 id="orge23d01f"><span class="section-number-3">4.15</span> Matlab</h3>
<div class="outline-text-3" id="text-4-15">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #81A1C1;">use-package</span> <span style="color: #81A1C1;">matlab</span>
  <span style="color: #81A1C1;">:disabled</span> t
  <span style="color: #81A1C1;">:init</span>
  (<span style="color: #81A1C1;">setq</span> matlab-shell-command-switches '(<span style="color: #A3BE8C;">"-nodesktop"</span>)))
</pre>
</div>
</div>
</div>

<div id="outline-container-org8ec3689" class="outline-3">
<h3 id="org8ec3689"><span class="section-number-3">4.16</span> Python</h3>
<div class="outline-text-3" id="text-4-16">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #81A1C1;">setq</span> python-fill-docstring-style 'pep-257)

(<span style="color: #81A1C1;">use-package</span> <span style="color: #81A1C1;">pyvenv</span>
  <span style="color: #81A1C1;">:straight</span> t)

(<span style="color: #81A1C1;">use-package</span> <span style="color: #81A1C1;">elpy</span>
  <span style="color: #81A1C1;">:straight</span> t
  <span style="color: #81A1C1;">:init</span>
  (<span style="color: #81A1C1;">setq</span> elpy-modules '(elpy-module-company
                       elpy-module-eldoc
                       elpy-module-flymake
                       elpy-module-pyvenv
                       elpy-module-yasnippet
                       elpy-module-sane-defaults))
  (elpy-enable))
</pre>
</div>
</div>
</div>

<div id="outline-container-org11b85df" class="outline-3">
<h3 id="org11b85df"><span class="section-number-3">4.17</span> Emacs Lisp</h3>
<div class="outline-text-3" id="text-4-17">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #81A1C1;">use-package</span> <span style="color: #81A1C1;">elisp-mode</span>
  <span style="color: #81A1C1;">:bind</span> ((<span style="color: #A3BE8C;">"C-c C-f"</span> . find-function)
         (<span style="color: #A3BE8C;">"C-c C-v"</span> . find-variable)))
</pre>
</div>
</div>
</div>

<div id="outline-container-org2f48343" class="outline-3">
<h3 id="org2f48343"><span class="section-number-3">4.18</span> Markdown</h3>
<div class="outline-text-3" id="text-4-18">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #81A1C1;">use-package</span> <span style="color: #81A1C1;">markdown-mode</span>
  <span style="color: #81A1C1;">:straight</span> t
  <span style="color: #81A1C1;">:mode</span> <span style="color: #A3BE8C;">"\\.md$"</span>
  <span style="color: #81A1C1;">:init</span>
  (<span style="color: #81A1C1;">setq</span> markdown-asymmetric-header t)
  <span style="color: #81A1C1;">:config</span>
  (add-hook 'markdown-mode-hook 'auto-fill-mode))

(<span style="color: #81A1C1;">use-package</span> <span style="color: #81A1C1;">markdown-mode+</span>
  <span style="color: #81A1C1;">:straight</span> t
  <span style="color: #81A1C1;">:after</span> markdown-mode)
</pre>
</div>
</div>
</div>

<div id="outline-container-org76316bc" class="outline-3">
<h3 id="org76316bc"><span class="section-number-3">4.19</span> YAML</h3>
<div class="outline-text-3" id="text-4-19">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #81A1C1;">use-package</span> <span style="color: #81A1C1;">yaml-mode</span>
  <span style="color: #81A1C1;">:straight</span> t
  <span style="color: #81A1C1;">:mode</span> <span style="color: #A3BE8C;">"\\.yaml$"</span>)
</pre>
</div>
</div>
</div>
