README.org
** Twitter

   #+begin_src emacs-lisp
     (with-eval-after-load 'projectile
       (projectile-register-project-type 'twitter-source-sub '(".pants.d")
                                         :compilation-dir "~/workspace/source/"
                                         :compile "./pants "
                                         :test "./pants test "
                                         :run "./pants "))
     (use-package twitter-source
       :straight (:local-repo "~/workspace/twitter-source.el"))
   #+end_src
   
** Scala

   #+begin_src emacs-lisp
     (use-package scala-mode
       :straight t)
   #+end_src
   
* General Packages

** =ace-link=

   #+BEGIN_SRC emacs-lisp
     (use-package ace-link
       :straight t
       :commands (ace-link-eww ace-link-setup-default)
       :init (ace-link-setup-default))
   #+END_SRC

** =ace-window=

   #+BEGIN_SRC emacs-lisp
     (use-package ace-window
       :commands ace-window
       :straight t
       :init
       (setq aw-keys '(?a ?r ?s ?t ?q ?w ?f ?p))

       :config
       ;; technically should be able to use mu4e~update-name but for whatever reason
       ;; the mu4e update index function uses the hardcoded string w/ space padding.
       (add-to-list 'aw-ignored-buffers " *mu4e-update*"))
   #+END_SRC

** =ansi-color=

   #+BEGIN_SRC emacs-lisp
     (use-package ansi-color
       :init
       (setq ansi-color-faces-vector
         [default bold shadow italic underline bold bold-italic bold])
       (setq compilation-scroll-output t)
       :config
       (defun colorize-compilation-buffer ()
         (toggle-read-only)
         (ansi-color-apply-on-region (point-min) (point-max))
         (toggle-read-only))

       (add-hook 'compilation-filter-hook 'colorize-compilation-buffer))
   #+END_SRC

** =browse-url=

   #+BEGIN_SRC emacs-lisp
     (use-package browse-url
       :config
       (setq browse-url-browser-function
             (if (browse-url-can-use-xdg-open) 'browse-url-xdg-open
               'browse-url-default-browser))

       ;; FIXME: regex search for chromium (some distros package the name differently)
       (setq browse-url-generic-program
             (if (eq system-type 'darwin)
                 "open"
               (executable-find "chromium-browser")))

       (setq shr-external-browser 'browse-url-generic))
   #+END_SRC

** =calc=

   #+BEGIN_SRC emacs-lisp
     (use-package calc
       :init
       (with-eval-after-load 'helm-exec
         (helm-exec-register-executable 'calc)))
   #+END_SRC

** =conf-mode=

   #+BEGIN_SRC emacs-lisp
     (use-package conf-mode
       :mode
       (;; systemd
         ("\\.service\\'"     . conf-unix-mode)
         ("\\.timer\\'"      . conf-unix-mode)
         ("\\.target\\'"     . conf-unix-mode)
         ("\\.mount\\'"      . conf-unix-mode)
         ("\\.automount\\'"  . conf-unix-mode)
         ("\\.slice\\'"      . conf-unix-mode)
         ("\\.socket\\'"     . conf-unix-mode)
         ("\\.path\\'"       . conf-unix-mode)

         ;; general
         ("conf\\(ig\\)?$"   . conf-mode)
         ("rc$"              . conf-mode)))

   #+END_SRC

** =company=

   #+BEGIN_SRC emacs-lisp
     (use-package company
       :defines company-backends
       :diminish company-mode
       :straight t
       :config
       (add-hook 'after-init-hook 'global-company-mode)
       (setq company-idle-delay 0.1))
   #+END_SRC

** =dired=

   #+BEGIN_SRC emacs-lisp
     (setq dired-listing-switches "-alh")

     (use-package dired-open
       :straight t
       :init
       (setq dired-open-extensions '(("mp4" . "vlc")
                                     ("avi" . "vlc"))))
   #+END_SRC

** =doc-view-mode=

   #+BEGIN_SRC emacs-lisp
     (use-package doc-view
       :init
       (setq doc-view-resolution 200))
   #+END_SRC

** =ediff=

   #+BEGIN_SRC emacs-lisp
     (use-package ediff
       :init
       (setq ediff-window-setup-function 'ediff-setup-windows-plain))
   #+END_SRC

** =exec-path-from-shell=

   #+BEGIN_SRC emacs-lisp
     (use-package exec-path-from-shell
       :straight t
       :config
       (exec-path-from-shell-initialize))
    #+END_SRC

