index.html

<div id="outline-container-org1ed32b5" class="outline-3">
<h3 id="org1ed32b5"><span class="section-number-3">4.20</span> Twitter</h3>
<div class="outline-text-3" id="text-4-20">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #81A1C1;">with-eval-after-load</span> 'projectile
  (projectile-register-project-type 'twitter-source-sub '(<span style="color: #A3BE8C;">".pants.d"</span>)
                                    <span style="color: #81A1C1;">:compilation-dir</span> <span style="color: #A3BE8C;">"~/workspace/source/"</span>
                                    <span style="color: #81A1C1;">:compile</span> <span style="color: #A3BE8C;">"./pants "</span>
                                    <span style="color: #81A1C1;">:test</span> <span style="color: #A3BE8C;">"./pants test "</span>
                                    <span style="color: #81A1C1;">:run</span> <span style="color: #A3BE8C;">"./pants "</span>))
(<span style="color: #81A1C1;">use-package</span> <span style="color: #81A1C1;">twitter-source</span>
  <span style="color: #81A1C1;">:straight</span> (<span style="color: #81A1C1;">:local-repo</span> <span style="color: #A3BE8C;">"~/workspace/twitter-source.el"</span>))
</pre>
</div>
</div>
</div>

<div id="outline-container-org0824464" class="outline-3">
<h3 id="org0824464"><span class="section-number-3">4.21</span> Scala</h3>
<div class="outline-text-3" id="text-4-21">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #81A1C1;">use-package</span> <span style="color: #81A1C1;">scala-mode</span>
  <span style="color: #81A1C1;">:straight</span> t)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org4c1c019" class="outline-2">
<h2 id="org4c1c019"><span class="section-number-2">5</span> General Packages</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org261b68c" class="outline-3">
<h3 id="org261b68c"><span class="section-number-3">5.1</span> <code>ace-link</code></h3>
<div class="outline-text-3" id="text-5-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #81A1C1;">use-package</span> <span style="color: #81A1C1;">ace-link</span>
  <span style="color: #81A1C1;">:straight</span> t
  <span style="color: #81A1C1;">:commands</span> (ace-link-eww ace-link-setup-default)
  <span style="color: #81A1C1;">:init</span> (ace-link-setup-default))
</pre>
</div>
</div>
</div>

<div id="outline-container-org762fc38" class="outline-3">
<h3 id="org762fc38"><span class="section-number-3">5.2</span> <code>ace-window</code></h3>
<div class="outline-text-3" id="text-5-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #81A1C1;">use-package</span> <span style="color: #81A1C1;">ace-window</span>
  <span style="color: #81A1C1;">:commands</span> ace-window
  <span style="color: #81A1C1;">:straight</span> t
  <span style="color: #81A1C1;">:init</span>
  (<span style="color: #81A1C1;">setq</span> aw-keys '(?a ?r ?s ?t ?q ?w ?f ?p))

  <span style="color: #81A1C1;">:config</span>
  <span style="color: #616e88;">;; </span><span style="color: #616e88;">technically should be able to use mu4e~update-name but for whatever reason</span>
  <span style="color: #616e88;">;; </span><span style="color: #616e88;">the mu4e update index function uses the hardcoded string w/ space padding.</span>
  (add-to-list 'aw-ignored-buffers <span style="color: #A3BE8C;">" *mu4e-update*"</span>))
</pre>
</div>
</div>
</div>

<div id="outline-container-org6416574" class="outline-3">
<h3 id="org6416574"><span class="section-number-3">5.3</span> <code>ansi-color</code></h3>
<div class="outline-text-3" id="text-5-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #81A1C1;">use-package</span> <span style="color: #81A1C1;">ansi-color</span>
  <span style="color: #81A1C1;">:init</span>
  (<span style="color: #81A1C1;">setq</span> ansi-color-faces-vector
    [default bold shadow italic underline bold bold-italic bold])
  (<span style="color: #81A1C1;">setq</span> compilation-scroll-output t)
  <span style="color: #81A1C1;">:config</span>
  (<span style="color: #81A1C1;">defun</span> <span style="color: #88C0D0;">colorize-compilation-buffer</span> ()
    (toggle-read-only)
    (ansi-color-apply-on-region (point-min) (point-max))
    (toggle-read-only))

  (add-hook 'compilation-filter-hook 'colorize-compilation-buffer))
</pre>
</div>
</div>
</div>

<div id="outline-container-org7d397cb" class="outline-3">
<h3 id="org7d397cb"><span class="section-number-3">5.4</span> <code>browse-url</code></h3>
<div class="outline-text-3" id="text-5-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #81A1C1;">use-package</span> <span style="color: #81A1C1;">browse-url</span>
  <span style="color: #81A1C1;">:config</span>
  (<span style="color: #81A1C1;">setq</span> browse-url-browser-function
        (<span style="color: #81A1C1;">if</span> (browse-url-can-use-xdg-open) 'browse-url-xdg-open
          'browse-url-default-browser))

  <span style="color: #616e88;">;; </span><span style="color: #616e88;">FIXME: regex search for chromium (some distros package the name differently)</span>
  (<span style="color: #81A1C1;">setq</span> browse-url-generic-program
        (<span style="color: #81A1C1;">if</span> (eq system-type 'darwin)
            <span style="color: #A3BE8C;">"open"</span>
          (executable-find <span style="color: #A3BE8C;">"chromium-browser"</span>)))

  (<span style="color: #81A1C1;">setq</span> shr-external-browser 'browse-url-generic))
</pre>
</div>
</div>
</div>

<div id="outline-container-org7b9d62a" class="outline-3">
<h3 id="org7b9d62a"><span class="section-number-3">5.5</span> <code>calc</code></h3>
<div class="outline-text-3" id="text-5-5">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #81A1C1;">use-package</span> <span style="color: #81A1C1;">calc</span>
  <span style="color: #81A1C1;">:init</span>
  (<span style="color: #81A1C1;">with-eval-after-load</span> 'helm-exec
    (helm-exec-register-executable 'calc)))
</pre>
</div>
</div>
</div>

<div id="outline-container-org2d59f24" class="outline-3">
<h3 id="org2d59f24"><span class="section-number-3">5.6</span> <code>conf-mode</code></h3>
<div class="outline-text-3" id="text-5-6">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #81A1C1;">use-package</span> <span style="color: #81A1C1;">conf-mode</span>
  <span style="color: #81A1C1;">:mode</span>
  (<span style="color: #616e88;">;; </span><span style="color: #616e88;">systemd</span>
    (<span style="color: #A3BE8C;">"\\.service\\'"</span>     . conf-unix-mode)
    (<span style="color: #A3BE8C;">"\\.timer\\'"</span>      . conf-unix-mode)
    (<span style="color: #A3BE8C;">"\\.target\\'"</span>     . conf-unix-mode)
    (<span style="color: #A3BE8C;">"\\.mount\\'"</span>      . conf-unix-mode)
    (<span style="color: #A3BE8C;">"\\.automount\\'"</span>  . conf-unix-mode)
    (<span style="color: #A3BE8C;">"\\.slice\\'"</span>      . conf-unix-mode)
    (<span style="color: #A3BE8C;">"\\.socket\\'"</span>     . conf-unix-mode)
    (<span style="color: #A3BE8C;">"\\.path\\'"</span>       . conf-unix-mode)

    <span style="color: #616e88;">;; </span><span style="color: #616e88;">general</span>
    (<span style="color: #A3BE8C;">"conf</span><span style="color: #EBCB8B;">\\</span><span style="color: #EBCB8B;">(</span><span style="color: #A3BE8C;">ig</span><span style="color: #EBCB8B;">\\</span><span style="color: #EBCB8B;">)</span><span style="color: #A3BE8C;">?$"</span>   . conf-mode)
    (<span style="color: #A3BE8C;">"rc$"</span>              . conf-mode)))

</pre>
</div>
</div>
</div>

<div id="outline-container-orgbfeb6d5" class="outline-3">
<h3 id="orgbfeb6d5"><span class="section-number-3">5.7</span> <code>company</code></h3>
<div class="outline-text-3" id="text-5-7">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #81A1C1;">use-package</span> <span style="color: #81A1C1;">company</span>
  <span style="color: #81A1C1;">:defines</span> company-backends
  <span style="color: #81A1C1;">:diminish</span> company-mode
  <span style="color: #81A1C1;">:straight</span> t
  <span style="color: #81A1C1;">:config</span>
  (add-hook 'after-init-hook 'global-company-mode)
  (<span style="color: #81A1C1;">setq</span> company-idle-delay 0.1))
</pre>
</div>
</div>
</div>

<div id="outline-container-org2de88a5" class="outline-3">
<h3 id="org2de88a5"><span class="section-number-3">5.8</span> <code>dired</code></h3>
<div class="outline-text-3" id="text-5-8">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #81A1C1;">setq</span> dired-listing-switches <span style="color: #A3BE8C;">"-alh"</span>)

(<span style="color: #81A1C1;">use-package</span> <span style="color: #81A1C1;">dired-open</span>
  <span style="color: #81A1C1;">:straight</span> t
  <span style="color: #81A1C1;">:init</span>
  (<span style="color: #81A1C1;">setq</span> dired-open-extensions '((<span style="color: #A3BE8C;">"mp4"</span> . <span style="color: #A3BE8C;">"vlc"</span>)
                                (<span style="color: #A3BE8C;">"avi"</span> . <span style="color: #A3BE8C;">"vlc"</span>))))
</pre>
</div>
</div>
</div>

<div id="outline-container-org444a83e" class="outline-3">
<h3 id="org444a83e"><span class="section-number-3">5.9</span> <code>doc-view-mode</code></h3>
<div class="outline-text-3" id="text-5-9">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #81A1C1;">use-package</span> <span style="color: #81A1C1;">doc-view</span>
  <span style="color: #81A1C1;">:init</span>
  (<span style="color: #81A1C1;">setq</span> doc-view-resolution 200))
</pre>
</div>
</div>
</div>

<div id="outline-container-org3dc0d0b" class="outline-3">
<h3 id="org3dc0d0b"><span class="section-number-3">5.10</span> <code>ediff</code></h3>
<div class="outline-text-3" id="text-5-10">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #81A1C1;">use-package</span> <span style="color: #81A1C1;">ediff</span>
  <span style="color: #81A1C1;">:init</span>
  (<span style="color: #81A1C1;">setq</span> ediff-window-setup-function 'ediff-setup-windows-plain))
</pre>
</div>
</div>
</div>

<div id="outline-container-org186c91a" class="outline-3">
<h3 id="org186c91a"><span class="section-number-3">5.11</span> <code>exec-path-from-shell</code></h3>
<div class="outline-text-3" id="text-5-11">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #81A1C1;">use-package</span> <span style="color: #81A1C1;">exec-path-from-shell</span>
  <span style="color: #81A1C1;">:straight</span> t
  <span style="color: #81A1C1;">:config</span>
  (exec-path-from-shell-initialize))
</pre>
</div>
</div>
</div>
