README.org
** Elfeed

   #+BEGIN_SRC emacs-lisp
     (use-package elfeed
       :straight t
       :commands elfeed
       :bind (:map elfeed-search-mode-map
              ("<SPC>" . next-line)
              ("U" . elfeed-unjam)
              :map elfeed-show-mode-map
              ("S-<SPC>" . scroll-down-command))

       :init
       (with-eval-after-load 'helm-exec
         (helm-exec-register-executable 'elfeed 'elfeed))

       (setq elfeed-use-curl t)
       (setq elfeed-log-level 'debug)

       :config
       (with-eval-after-load 'evil
         (add-to-list 'evil-emacs-state-modes 'elfeed-search-mode)
         (add-to-list 'evil-emacs-state-modes 'elfeed-show-mode))

       (set-face-attribute 'elfeed-search-feed-face
                           nil
                           :foreground (face-attribute 'warning :foreground))

       (set-face-attribute 'elfeed-search-tag-face
                           nil
                           :foreground (face-attribute 'success :foreground))

       (set-face-attribute 'elfeed-search-unread-title-face
                           nil
                           :weight 'normal
                           :foreground (face-attribute 'default :foreground))

       (set-face-attribute 'elfeed-search-title-face
                           nil
                           :foreground (face-attribute 'font-lock-comment-face :foreground)))

     (use-package elfeed-protocol
       :disabled t
       :after elfeed
       :straight (:host github
                  :type git
                  :repo "fasheng/elfeed-protocol"
                  :fork (:host github :repo "jinnovation/elfeed-protocol" :branch "master"))

       :if (-all-p 'boundp '(jjin/secret/ttrss-domain
                             jjin/secret/ttrss-username
                             jjin/secret/ttrss-pass))
       :init
       (setq elfeed-feeds
             (list (format "ttrss+http://%s:%s@%s" jjin/secret/ttrss-username jjin/secret/ttrss-pass jjin/secret/ttrss-domain)))

       (setq elfeed-protocol-ttrss-categories-as-tags t)

       :config
       (elfeed-protocol-enable))
   #+END_SRC
   
** Eshell

   #+BEGIN_SRC emacs-lisp
     ;; From: https://www.emacswiki.org/emacs/EshellPrompt
     (defun shortened-path (path max-len)
           "Return a modified version of `path', replacing some components
           with single characters starting from the left to try and get
           the path down to `max-len'"
           (let* ((components (split-string (abbreviate-file-name path) "/"))
                  (len (+ (1- (length components))
                          (reduce '+ components :key 'length)))
                  (str ""))
             (while (and (> len max-len)
                         (cdr components))
               (setq str (concat str (if (= 0 (length (car components)))
                                         "/"
                                       (string (elt (car components) 0) ?/)))
                     len (- len (1- (length (car components))))
                     components (cdr components)))
             (concat str (reduce (lambda (a b) (concat a "/" b)) components))))

     (use-package eshell
       :init
       (setq eshell-rc-script (concat user-emacs-directory "eshell/profile"))
       (setq eshell-modify-global-environment t)
       (setq eshell-banner-message "")

       :config
       (with-eval-after-load 'evil
         (delete 'eshell-mode evil-insert-state-modes)
         (add-to-list 'evil-emacs-state-modes 'eshell-mode))

       (bind-keys :map jjin-term-map
                  ("e" . eshell))

       (defun eshell/la (&rest args)
         (eshell/ls "--almost-all" "-l" args))

       (with-eval-after-load 'magit
         (setq eshell-prompt-function
               (lambda ()
                 (concat
                  (propertize "┌─[" 'face 'font-lock-string-face)
                  (propertize (user-login-name) 'face 'font-lock-function-name-face)
                  (propertize "@" 'face 'font-lock-string-face)
                  (when-let ((b (magit-get-current-branch)))
                    (propertize b 'face `(:foreground "yellow")))
                  (when (magit-anything-modified-p)
                    (propertize "*" 'face `(:foreground "yellow")))
                  (propertize "]──[" 'face 'font-lock-string-face)
                  (propertize (format-time-string "%H:%M:%S" (current-time)) 'face 'font-lock-keyword-face)
                  (propertize "]──[" 'face 'font-lock-string-face)
                  (propertize (shortened-path (eshell/pwd) 40) 'face `(:foreground "white"))
                  (propertize "]\n" 'face 'font-lock-string-face)
                  (propertize "└─>" 'face 'font-lock-string-face)
                  (propertize (if (= (user-uid) 0) " #" " $") 'face 'font-lock-string-face)
                  " "
                  )))))
   #+END_SRC
   
*** Initialization file

    #+BEGIN_SRC emacs-lisp :tangle eshell/profile
    (setenv "EDITOR" "emacsclient")
    #+END_SRC

** =ess=

   #+BEGIN_SRC emacs-lisp
     (use-package ess-site
       :disabled t
       :ensure ess
       :commands (inferior-ess-mode ess-help-mode)
       :init
       (setq inferior-R-args "--quiet")

       :config
       (with-eval-after-load 'evil
           (progn
             (add-to-list 'evil-emacs-state-modes 'inferior-ess-mode)
             (add-to-list 'evil-emacs-state-modes 'ess-help-mode)))
       (bind-key "C-c C-w" nil inferior-ess-mode-map))
   #+END_SRC

