index.html

<div id="outline-container-org87ba4eb" class="outline-3">
<h3 id="org87ba4eb"><span class="section-number-3">5.12</span> Elfeed</h3>
<div class="outline-text-3" id="text-5-12">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #81A1C1;">use-package</span> <span style="color: #81A1C1;">elfeed</span>
  <span style="color: #81A1C1;">:straight</span> t
  <span style="color: #81A1C1;">:commands</span> elfeed
  <span style="color: #81A1C1;">:bind</span> (<span style="color: #81A1C1;">:map</span> elfeed-search-mode-map
         (<span style="color: #A3BE8C;">"&lt;SPC&gt;"</span> . next-line)
         (<span style="color: #A3BE8C;">"U"</span> . elfeed-unjam)
         <span style="color: #81A1C1;">:map</span> elfeed-show-mode-map
         (<span style="color: #A3BE8C;">"S-&lt;SPC&gt;"</span> . scroll-down-command))

  <span style="color: #81A1C1;">:init</span>
  (<span style="color: #81A1C1;">with-eval-after-load</span> 'helm-exec
    (helm-exec-register-executable 'elfeed 'elfeed))

  (<span style="color: #81A1C1;">setq</span> elfeed-use-curl t)
  (<span style="color: #81A1C1;">setq</span> elfeed-log-level 'debug)

  <span style="color: #81A1C1;">:config</span>
  (<span style="color: #81A1C1;">with-eval-after-load</span> 'evil
    (add-to-list 'evil-emacs-state-modes 'elfeed-search-mode)
    (add-to-list 'evil-emacs-state-modes 'elfeed-show-mode))

  (set-face-attribute 'elfeed-search-feed-face
                      nil
                      <span style="color: #81A1C1;">:foreground</span> (face-attribute 'warning <span style="color: #81A1C1;">:foreground</span>))

  (set-face-attribute 'elfeed-search-tag-face
                      nil
                      <span style="color: #81A1C1;">:foreground</span> (face-attribute 'success <span style="color: #81A1C1;">:foreground</span>))

  (set-face-attribute 'elfeed-search-unread-title-face
                      nil
                      <span style="color: #81A1C1;">:weight</span> 'normal
                      <span style="color: #81A1C1;">:foreground</span> (face-attribute 'default <span style="color: #81A1C1;">:foreground</span>))

  (set-face-attribute 'elfeed-search-title-face
                      nil
                      <span style="color: #81A1C1;">:foreground</span> (face-attribute 'font-lock-comment-face <span style="color: #81A1C1;">:foreground</span>)))

(<span style="color: #81A1C1;">use-package</span> <span style="color: #81A1C1;">elfeed-protocol</span>
  <span style="color: #81A1C1;">:disabled</span> t
  <span style="color: #81A1C1;">:after</span> elfeed
  <span style="color: #81A1C1;">:straight</span> (<span style="color: #81A1C1;">:host</span> github
             <span style="color: #81A1C1;">:type</span> git
             <span style="color: #81A1C1;">:repo</span> <span style="color: #A3BE8C;">"fasheng/elfeed-protocol"</span>
             <span style="color: #81A1C1;">:fork</span> (<span style="color: #81A1C1;">:host</span> github <span style="color: #81A1C1;">:repo</span> <span style="color: #A3BE8C;">"jinnovation/elfeed-protocol"</span> <span style="color: #81A1C1;">:branch</span> <span style="color: #A3BE8C;">"master"</span>))

  <span style="color: #81A1C1;">:if</span> (-all-p 'boundp '(jjin/secret/ttrss-domain
                        jjin/secret/ttrss-username
                        jjin/secret/ttrss-pass))
  <span style="color: #81A1C1;">:init</span>
  (<span style="color: #81A1C1;">setq</span> elfeed-feeds
        (list (format <span style="color: #A3BE8C;">"ttrss+http://%s:%s@%s"</span> jjin/secret/ttrss-username jjin/secret/ttrss-pass jjin/secret/ttrss-domain)))

  (<span style="color: #81A1C1;">setq</span> elfeed-protocol-ttrss-categories-as-tags t)

  <span style="color: #81A1C1;">:config</span>
  (elfeed-protocol-enable))
</pre>
</div>
</div>
</div>

<div id="outline-container-org44ad9c2" class="outline-3">
<h3 id="org44ad9c2"><span class="section-number-3">5.13</span> Eshell</h3>
<div class="outline-text-3" id="text-5-13">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #616e88;">;; </span><span style="color: #616e88;">From: https://www.emacswiki.org/emacs/EshellPrompt</span>
(<span style="color: #81A1C1;">defun</span> <span style="color: #88C0D0;">shortened-path</span> (path max-len)
      <span style="color: #616e88;">"Return a modified version of `</span><span style="color: #81A1C1;">path</span><span style="color: #616e88;">', replacing some components</span>
<span style="color: #616e88;">      with single characters starting from the left to try and get</span>
<span style="color: #616e88;">      the path down to `</span><span style="color: #81A1C1;">max-len</span><span style="color: #616e88;">'"</span>
      (<span style="color: #81A1C1;">let*</span> ((components (split-string (abbreviate-file-name path) <span style="color: #A3BE8C;">"/"</span>))
             (len (+ (1- (length components))
                     (reduce '+ components <span style="color: #81A1C1;">:key</span> 'length)))
             (str <span style="color: #A3BE8C;">""</span>))
        (<span style="color: #81A1C1;">while</span> (<span style="color: #81A1C1;">and</span> (&gt; len max-len)
                    (cdr components))
          (<span style="color: #81A1C1;">setq</span> str (concat str (<span style="color: #81A1C1;">if</span> (= 0 (length (car components)))
                                    <span style="color: #A3BE8C;">"/"</span>
                                  (string (elt (car components) 0) ?/)))
                len (- len (1- (length (car components))))
                components (cdr components)))
        (concat str (reduce (<span style="color: #81A1C1;">lambda</span> (a b) (concat a <span style="color: #A3BE8C;">"/"</span> b)) components))))

(<span style="color: #81A1C1;">use-package</span> <span style="color: #81A1C1;">eshell</span>
  <span style="color: #81A1C1;">:init</span>
  (<span style="color: #81A1C1;">setq</span> eshell-rc-script (concat user-emacs-directory <span style="color: #A3BE8C;">"eshell/profile"</span>))
  (<span style="color: #81A1C1;">setq</span> eshell-modify-global-environment t)
  (<span style="color: #81A1C1;">setq</span> eshell-banner-message <span style="color: #A3BE8C;">""</span>)

  <span style="color: #81A1C1;">:config</span>
  (<span style="color: #81A1C1;">with-eval-after-load</span> 'evil
    (delete 'eshell-mode evil-insert-state-modes)
    (add-to-list 'evil-emacs-state-modes 'eshell-mode))

  (<span style="color: #81A1C1;">bind-keys</span> <span style="color: #81A1C1;">:map</span> jjin-term-map
             (<span style="color: #A3BE8C;">"e"</span> . eshell))

  (<span style="color: #81A1C1;">defun</span> <span style="color: #88C0D0;">eshell/la</span> (<span style="color: #8FBCBB;">&amp;rest</span> args)
    (eshell/ls <span style="color: #A3BE8C;">"--almost-all"</span> <span style="color: #A3BE8C;">"-l"</span> args))

  (<span style="color: #81A1C1;">with-eval-after-load</span> 'magit
    (<span style="color: #81A1C1;">setq</span> eshell-prompt-function
          (<span style="color: #81A1C1;">lambda</span> ()
            (concat
             (propertize <span style="color: #A3BE8C;">"&#9484;&#9472;["</span> 'face 'font-lock-string-face)
             (propertize (user-login-name) 'face 'font-lock-function-name-face)
             (propertize <span style="color: #A3BE8C;">"@"</span> 'face 'font-lock-string-face)
             (<span style="color: #81A1C1;">when-let</span> ((b (magit-get-current-branch)))
               (propertize b 'face `(<span style="color: #81A1C1;">:foreground</span> <span style="color: #A3BE8C;">"yellow"</span>)))
             (<span style="color: #81A1C1;">when</span> (magit-anything-unstaged-p)
               (propertize <span style="color: #A3BE8C;">"*"</span> 'face `(<span style="color: #81A1C1;">:foreground</span> <span style="color: #A3BE8C;">"yellow"</span>)))
             (propertize <span style="color: #A3BE8C;">"]&#9472;&#9472;["</span> 'face 'font-lock-string-face)
             (propertize (format-time-string <span style="color: #A3BE8C;">"%H:%M:%S"</span> (current-time)) 'face 'font-lock-keyword-face)
             (propertize <span style="color: #A3BE8C;">"]&#9472;&#9472;["</span> 'face 'font-lock-string-face)
             (propertize (shortened-path (eshell/pwd) 40) 'face `(<span style="color: #81A1C1;">:foreground</span> <span style="color: #A3BE8C;">"white"</span>))
             (propertize <span style="color: #A3BE8C;">"]\n"</span> 'face 'font-lock-string-face)
             (propertize <span style="color: #A3BE8C;">"&#9492;&#9472;&gt;"</span> 'face 'font-lock-string-face)
             (propertize (<span style="color: #81A1C1;">if</span> (= (user-uid) 0) <span style="color: #A3BE8C;">" #"</span> <span style="color: #A3BE8C;">" $"</span>) 'face 'font-lock-string-face)
             <span style="color: #A3BE8C;">" "</span>
             )))))
</pre>
</div>
</div>

<div id="outline-container-org32ea771" class="outline-4">
<h4 id="org32ea771"><span class="section-number-4">5.13.1</span> Initialization file</h4>
<div class="outline-text-4" id="text-5-13-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(setenv <span style="color: #A3BE8C;">"EDITOR"</span> <span style="color: #A3BE8C;">"emacsclient"</span>)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org7ce2f71" class="outline-3">
<h3 id="org7ce2f71"><span class="section-number-3">5.14</span> <code>ess</code></h3>
<div class="outline-text-3" id="text-5-14">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #81A1C1;">use-package</span> <span style="color: #81A1C1;">ess-site</span>
  <span style="color: #81A1C1;">:disabled</span> t
  <span style="color: #81A1C1;">:ensure</span> ess
  <span style="color: #81A1C1;">:commands</span> (inferior-ess-mode ess-help-mode)
  <span style="color: #81A1C1;">:init</span>
  (<span style="color: #81A1C1;">setq</span> inferior-R-args <span style="color: #A3BE8C;">"--quiet"</span>)

  <span style="color: #81A1C1;">:config</span>
  (<span style="color: #81A1C1;">with-eval-after-load</span> 'evil
      (<span style="color: #81A1C1;">progn</span>
        (add-to-list 'evil-emacs-state-modes 'inferior-ess-mode)
        (add-to-list 'evil-emacs-state-modes 'ess-help-mode)))
  (<span style="color: #81A1C1;">bind-key</span> <span style="color: #A3BE8C;">"C-c C-w"</span> nil inferior-ess-mode-map))
</pre>
</div>
</div>
</div>
