index.html

<div id="outline-container-org9f02ea0" class="outline-3">
<h3 id="org9f02ea0"><span class="section-number-3">5.15</span> Evil (base + extras)</h3>
<div class="outline-text-3" id="text-5-15">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #81A1C1;">use-package</span> <span style="color: #81A1C1;">evil</span>
  <span style="color: #81A1C1;">:straight</span> t
  <span style="color: #81A1C1;">:defines</span> evil-normal-state-map
  <span style="color: #81A1C1;">:init</span>
  (<span style="color: #81A1C1;">setq</span> evil-esc-delay 0)

  <span style="color: #81A1C1;">:config</span>
  (mapc (<span style="color: #81A1C1;">lambda</span> (m) (add-to-list 'evil-emacs-state-modes m t))
    '(eshell-mode
       calendar-mode

       finder-mode
       info-mode

       eww-mode
       eww-bookmark-mode

       dired-mode
       image-mode
       image-dired-thumbnail-mode
       image-dired-display-image-mode

       git-rebase-mode

       help-mode

       sql-interactive-mode
       org-capture-mode))
  <span style="color: #616e88;">;; </span><span style="color: #616e88;">FIXME: what's the diff between set-initial-state and adding to list directly?</span>
  (evil-set-initial-state 'term-mode 'emacs)

  (<span style="color: #81A1C1;">bind-keys</span> <span style="color: #81A1C1;">:map</span> evil-emacs-state-map
    (<span style="color: #A3BE8C;">"&lt;escape&gt;"</span> . evil-execute-in-normal-state))

  (evil-mode 1))

(<span style="color: #81A1C1;">use-package</span> <span style="color: #81A1C1;">evil-numbers</span>
  <span style="color: #81A1C1;">:after</span> evil
  <span style="color: #81A1C1;">:straight</span> t
  <span style="color: #81A1C1;">:config</span>
  (<span style="color: #81A1C1;">bind-keys</span> <span style="color: #81A1C1;">:map</span> evil-normal-state-map
             (<span style="color: #A3BE8C;">"C-a"</span>   . evil-numbers/inc-at-pt)
             (<span style="color: #A3BE8C;">"C-c -"</span> . evil-numbers/dec-at-pt)))

(<span style="color: #81A1C1;">use-package</span> <span style="color: #81A1C1;">evil-search-highlight-persist</span>
  <span style="color: #81A1C1;">:after</span> evil
  <span style="color: #81A1C1;">:straight</span> t
  <span style="color: #81A1C1;">:config</span>
  (<span style="color: #81A1C1;">bind-key</span> <span style="color: #A3BE8C;">"C-l"</span> 'evil-search-highlight-persist-remove-all
            evil-normal-state-map)
  (global-evil-search-highlight-persist t)

  (set-face-attribute
   'evil-search-highlight-persist-highlight-face
   nil
   <span style="color: #81A1C1;">:background</span> (face-attribute 'match <span style="color: #81A1C1;">:background</span>)))

(<span style="color: #81A1C1;">use-package</span> <span style="color: #81A1C1;">evil-surround</span>
  <span style="color: #81A1C1;">:after</span> evil
  <span style="color: #81A1C1;">:straight</span> t
  <span style="color: #81A1C1;">:config</span>
  (global-evil-surround-mode 1))

(<span style="color: #81A1C1;">use-package</span> <span style="color: #81A1C1;">evil-nerd-commenter</span>
  <span style="color: #81A1C1;">:after</span> evil
  <span style="color: #81A1C1;">:straight</span> t
  <span style="color: #81A1C1;">:config</span>
  (<span style="color: #81A1C1;">bind-keys</span> <span style="color: #81A1C1;">:map</span> jjin-comment-map
             (<span style="color: #A3BE8C;">"i"</span> . evilnc-comment-or-uncomment-lines)
             (<span style="color: #A3BE8C;">"l"</span> . evilnc-quick-comment-or-uncomment-to-the-line)
             (<span style="color: #A3BE8C;">"c"</span> . evilnc-copy-and-comment-lines)
             (<span style="color: #A3BE8C;">"p"</span> . evilnc-comment-or-uncomment-paragraphs)
             (<span style="color: #A3BE8C;">"v"</span> . evilnc-toggle-invert-comment-line-by-line)))

</pre>
</div>
</div>
</div>

<div id="outline-container-orgf6fa121" class="outline-3">
<h3 id="orgf6fa121"><span class="section-number-3">5.16</span> <code>fill-column-indicator</code></h3>
<div class="outline-text-3" id="text-5-16">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #81A1C1;">use-package</span> <span style="color: #81A1C1;">fill-column-indicator</span>
  <span style="color: #81A1C1;">:commands</span> turn-on-fci-mode
  <span style="color: #81A1C1;">:straight</span> t
  <span style="color: #81A1C1;">:disabled</span> t
  <span style="color: #81A1C1;">:init</span>
  (add-hook 'prog-mode-hook 'turn-on-fci-mode)
  (add-hook 'text-mode-hook 'turn-on-fci-mode)
  (<span style="color: #81A1C1;">setq</span> fci-rule-color (face-attribute 'highlight <span style="color: #81A1C1;">:background</span>)))
</pre>
</div>
</div>
</div>

<div id="outline-container-org6067f41" class="outline-3">
<h3 id="org6067f41"><span class="section-number-3">5.17</span> <code>flycheck</code></h3>
<div class="outline-text-3" id="text-5-17">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #81A1C1;">use-package</span> <span style="color: #81A1C1;">flycheck</span>
  <span style="color: #81A1C1;">:disabled</span> t
  <span style="color: #81A1C1;">:defines</span> flycheck-mode-hook
  <span style="color: #81A1C1;">:config</span>
  (add-hook 'after-init-hook #'global-flycheck-mode))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgac2c73c" class="outline-3">
<h3 id="orgac2c73c"><span class="section-number-3">5.18</span> Git</h3>
<div class="outline-text-3" id="text-5-18">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #81A1C1;">bind-keys</span> <span style="color: #81A1C1;">:map</span> jjin-vc-map
           (<span style="color: #A3BE8C;">"g"</span> . vc-git-grep))

(<span style="color: #81A1C1;">setq</span> vc-handled-backends nil)
</pre>
</div>
</div>

<div id="outline-container-orgc25de86" class="outline-4">
<h4 id="orgc25de86"><span class="section-number-4">5.18.1</span> <code>git-commit-mode</code></h4>
<div class="outline-text-4" id="text-5-18-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #81A1C1;">use-package</span> <span style="color: #81A1C1;">git-commit-mode</span>
  <span style="color: #81A1C1;">:commands</span> git-commit-mode)
</pre>
</div>
</div>
</div>

<div id="outline-container-org5e16011" class="outline-4">
<h4 id="org5e16011"><span class="section-number-4">5.18.2</span> <code>gitconfig-mode</code></h4>
<div class="outline-text-4" id="text-5-18-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #81A1C1;">use-package</span> <span style="color: #81A1C1;">gitconfig-mode</span>
  <span style="color: #81A1C1;">:straight</span> t
  <span style="color: #81A1C1;">:mode</span> <span style="color: #A3BE8C;">"gitconfig"</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-org57f1c6c" class="outline-4">
<h4 id="org57f1c6c"><span class="section-number-4">5.18.3</span> <code>gitignore-mode</code></h4>
<div class="outline-text-4" id="text-5-18-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #81A1C1;">use-package</span> <span style="color: #81A1C1;">gitignore-mode</span>
  <span style="color: #81A1C1;">:straight</span> t
  <span style="color: #81A1C1;">:mode</span> <span style="color: #A3BE8C;">"gitignore"</span>)
</pre>
</div>
</div>
</div>
