index.html

<div id="outline-container-org7f4405c" class="outline-4">
<h4 id="org7f4405c"><span class="section-number-4">5.18.4</span> Magit</h4>
<div class="outline-text-4" id="text-5-18-4">
<p>
Merge commits can sometimes be massive &#x2013; particularly in monorepo
environments. Since showing the diff during commit in such scenarios is of
questionable utility, we suppress its behavior with the following advice.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #81A1C1;">defun</span> <span style="color: #88C0D0;">jjin/do-if-merge-not-in-progress</span> (oldfun)
  <span style="color: #616e88;">"Displays the diff during commit only in cases where a merge is</span>
<span style="color: #616e88;">  not in progress."</span>
  (<span style="color: #81A1C1;">when</span> (not (magit-merge-in-progress-p)) (funcall oldfun)))

(<span style="color: #81A1C1;">defun</span> <span style="color: #88C0D0;">jjin/magit-fetch-from-origin-master</span> ()
  (<span style="color: #81A1C1;">interactive</span>)
  (magit-git-fetch <span style="color: #A3BE8C;">"origin"</span> <span style="color: #A3BE8C;">"master"</span>))

(<span style="color: #81A1C1;">defun</span> <span style="color: #88C0D0;">jjin/magit-checkout-previous-branch</span> ()
  (<span style="color: #81A1C1;">interactive</span>)
  (<span style="color: #81A1C1;">if-let</span> ((p (magit-get-previous-branch)))
      (magit-checkout p)
    (<span style="color: #EBCB8B;">error</span> <span style="color: #A3BE8C;">"No previous branch"</span>)))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #616e88;">;; </span><span style="color: #616e88;">TODO: Magit has migrated to using transient, so all commented sections will</span>
<span style="color: #616e88;">;; </span><span style="color: #616e88;">eventually need to be updated or removed.</span>

(<span style="color: #81A1C1;">use-package</span> <span style="color: #81A1C1;">magit</span>
  <span style="color: #81A1C1;">:straight</span> t
  <span style="color: #81A1C1;">:init</span>

  (add-to-list
   'safe-local-variable-values
   '(magit-status-headers-hook . (list
                                  magit-insert-error-header
                                  magit-insert-diff-filter-header
                                  magit-insert-head-branch-header
                                  magit-insert-upstream-branch-header
                                  magit-insert-push-branch-header)))

  (<span style="color: #81A1C1;">setq</span> magit-popup-show-common-commands nil)
  (<span style="color: #81A1C1;">setq</span> magit-log-arguments '(<span style="color: #A3BE8C;">"--graph"</span>
                              <span style="color: #A3BE8C;">"--decorate"</span>
                              <span style="color: #A3BE8C;">"--color"</span>))

  (<span style="color: #81A1C1;">setq</span> magit-display-buffer-function 'magit-display-buffer-same-window-except-diff-v1)

  <span style="color: #81A1C1;">:config</span>
  (<span style="color: #81A1C1;">bind-keys</span> <span style="color: #81A1C1;">:map</span> jjin-vc-map
             (<span style="color: #A3BE8C;">"!"</span> . magit-git-command-topdir)
             (<span style="color: #A3BE8C;">"C"</span> . magit-branch-and-checkout)
             (<span style="color: #A3BE8C;">"F"</span> . magit-pull-popup)
             (<span style="color: #A3BE8C;">"P"</span> . magit-push-popup)
             (<span style="color: #A3BE8C;">"b"</span> . magit-blame-popup)
             (<span style="color: #A3BE8C;">"c"</span> . magit-checkout)
             (<span style="color: #A3BE8C;">"d"</span> . magit-diff-popup)
             (<span style="color: #A3BE8C;">"f"</span> . magit-fetch-popup)
             (<span style="color: #A3BE8C;">"l"</span> . magit-log-popup)
             (<span style="color: #A3BE8C;">"m"</span> . magit-merge-popup)
             (<span style="color: #A3BE8C;">"v"</span> . magit-status)
             (<span style="color: #A3BE8C;">"z"</span> . magit-stash-popup))

  (<span style="color: #81A1C1;">with-eval-after-load</span> 'git-rebase
    (<span style="color: #81A1C1;">bind-keys</span> <span style="color: #81A1C1;">:map</span> git-rebase-mode-map (<span style="color: #A3BE8C;">"u"</span> . git-rebase-undo)))

  (<span style="color: #81A1C1;">bind-keys</span> <span style="color: #81A1C1;">:map</span> magit-mode-map
             (<span style="color: #A3BE8C;">"X"</span> . magit-reset-hard))

  <span style="color: #616e88;">;; </span><span style="color: #616e88;">removes 1.4.0 warning in arguably cleaner way</span>
  (remove-hook 'after-init-hook 'magit-maybe-show-setup-instructions)

  (<span style="color: #81A1C1;">defadvice</span> <span style="color: #88C0D0;">magit-blame-mode</span> (after switch-to-emacs-state activate)
    (<span style="color: #81A1C1;">if</span> magit-blame-mode
        (evil-emacs-state 1)
      (evil-normal-state 1)))

  (<span style="color: #81A1C1;">with-eval-after-load</span> 'evil
    (add-to-list 'evil-emacs-state-modes 'magit-popup-mode))

  (add-hook 'magit-revision-mode-hook 'goto-address-mode)

  (magit-define-popup-option 'magit-commit-popup ?M <span style="color: #A3BE8C;">"Attach message"</span> <span style="color: #A3BE8C;">"--message="</span>)

  (magit-define-popup-action 'magit-diff-popup ?U
    <span style="color: #A3BE8C;">"Diff upstream"</span>
    (<span style="color: #81A1C1;">lambda</span> (<span style="color: #8FBCBB;">&amp;optional</span> args files)
      (<span style="color: #81A1C1;">interactive</span> (magit-diff-arguments))
      (magit-diff  <span style="color: #A3BE8C;">"@{u}..HEAD"</span> args)))


  (<span style="color: #81A1C1;">defun</span> <span style="color: #88C0D0;">jjin/magit-find-file-from-upstream</span> (file)
    <span style="color: #616e88;">"Same behavior as `</span><span style="color: #81A1C1;">magit-find-file</span><span style="color: #616e88;">', but specifically for the</span>
<span style="color: #616e88;">upstream branch."</span>
    (<span style="color: #81A1C1;">interactive</span>
     (list (magit-read-file-from-rev (magit-get-upstream-branch) <span style="color: #A3BE8C;">"Find file"</span>)))
    (magit-find-file (magit-get-upstream-branch) file))

  (plist-put magit-merge-popup <span style="color: #81A1C1;">:actions</span> (cons <span style="color: #A3BE8C;">"Actions"</span> (plist-get magit-merge-popup <span style="color: #81A1C1;">:actions</span>)))
  (plist-put magit-merge-popup
             <span style="color: #81A1C1;">:actions</span>
             (cons '(?U <span style="color: #A3BE8C;">"Upstream"</span> (<span style="color: #81A1C1;">lambda</span> (ignored <span style="color: #8FBCBB;">&amp;optional</span> args)
                                     (<span style="color: #81A1C1;">interactive</span> (magit-diff-arguments))
                                     (magit-merge <span style="color: #A3BE8C;">"@{u}"</span> args)))
                   (plist-get magit-merge-popup <span style="color: #81A1C1;">:actions</span>)))
  (plist-put
   magit-merge-popup
   <span style="color: #81A1C1;">:actions</span>
   (cons
    (<span style="color: #81A1C1;">lambda</span> ()
      (concat (propertize <span style="color: #A3BE8C;">"Merge into "</span> 'face 'magit-popup-heading)
              (propertize (<span style="color: #81A1C1;">or</span> (magit-get-current-branch) <span style="color: #A3BE8C;">"HEAD"</span>) 'face 'magit-branch-local)
              (propertize <span style="color: #A3BE8C;">" from"</span> 'face 'magit-popup-heading)))
    (plist-get magit-merge-popup <span style="color: #81A1C1;">:actions</span>)))

  (magit-define-popup-action 'magit-fetch-popup
    ?U <span style="color: #A3BE8C;">"from origin/master"</span> 'jjin/magit-fetch-from-origin-master)

  (magit-define-popup-action 'magit-branch-popup
    ?P
    (<span style="color: #81A1C1;">lambda</span> ()
      (<span style="color: #81A1C1;">if-let</span> ((p (magit-get-previous-branch)))
          <span style="color: #A3BE8C;">"Checkout previous branch"</span>
        <span style="color: #A3BE8C;">"No previous branch"</span>))
    'jjin/magit-checkout-previous-branch))

  <span style="color: #616e88;">;; </span><span style="color: #616e88;">(advice-add 'magit-commit-diff</span>
  <span style="color: #616e88;">;;             </span><span style="color: #616e88;">:before-until</span>
  <span style="color: #616e88;">;;             </span><span style="color: #616e88;">'magit-merge-in-progress-p))</span>

(<span style="color: #81A1C1;">use-package</span> <span style="color: #81A1C1;">magit-arcanist</span>
  <span style="color: #81A1C1;">:after</span> magit
  <span style="color: #81A1C1;">:straight</span> (<span style="color: #81A1C1;">:repo</span> <span style="color: #A3BE8C;">"git@github.com:jinnovation/magit-arcanist.git"</span>)
  <span style="color: #81A1C1;">:init</span>
  (<span style="color: #81A1C1;">setq</span> magit-arcanist-key (kbd <span style="color: #A3BE8C;">"@"</span>))
  <span style="color: #81A1C1;">:bind</span> (<span style="color: #81A1C1;">:map</span> jjin-vc-map
         (<span style="color: #A3BE8C;">"a"</span> . magit-arcanist-popup))
  <span style="color: #81A1C1;">:config</span>
  (magit-arcanist-enable))
</pre>
</div>
</div>
</div>
</div>
