README.org
** =helm=

   #+BEGIN_SRC emacs-lisp
     (use-package helm
       :straight t
       :demand t
       :diminish helm-mode
       :bind (("C-x m"    . helm-M-x)
              ("C-x C-f" . helm-find-files)
              ("C-x b"   . helm-buffers-list))
       :init
       (setq helm-external-programs-associations `(("pdf" . ,(if (eq system-type 'darwin) "open" "zathura"))))
       (setq helm-split-window-inside-p t)

       (setq helm-mode-fuzzy-match t)

       :config
       (helm-mode 1)
       (helm-autoresize-mode t)

       (defvar helm-source-file-not-found
         (helm-build-dummy-source
             "Create file"
           :action
           (lambda (c) (find-file c))))

       (bind-keys :map jjin-vc-map
                  ("g" . helm-grep-do-git-grep))

       ;; (bind-key "C-c C-j" 'helm-org-in-buffer-headings org-mode-map)

       (setq helm-ff-candidate-number-limit 500)
       )

     (use-package helm-make
       :straight t
       :commands helm-make-projectile
       :init
       (setq helm-make-cache-targets t)
       (setq helm-make-list-target-method 'qp))

     (use-package helm-projectile
       :after projectile
       :bind (:map projectile-command-map
                   ("p"   . helm-projectile)
                   ("a"   . helm-projectile-find-other-file)
                   ("f"   . helm-projectile-find-file)
                   ("F"   . helm-projectile-find-file-in-known-projects)
                   ("s s" . helm-projectile-ag)
                   ("s g" . helm-projectile-grep))
       :straight t
       :config
       (add-to-list 'helm-projectile-sources-list helm-source-file-not-found t))
   #+END_SRC

** =linum=

   #+BEGIN_SRC emacs-lisp
     (use-package linum
       :straight t
       :config
       (setq linum-format 'dynamic)
       (global-linum-mode 1)

       (defconst linum-mode-whitelist
         '(prog-mode))

       (require 'mode-local)

       (defadvice linum-mode (around linum-mode-selective activate)
         "Avoids enabling of linum-mode in the buffer having major mode set to one
     of listed in `linum-mode-excludes'."
         (if (or (member major-mode linum-mode-whitelist)
                 (member (get-mode-local-parent major-mode) linum-mode-whitelist))
           ad-do-it)))
   #+END_SRC

** =multi-term=

   #+BEGIN_SRC emacs-lisp
     (use-package multi-term
       :straight t
       :config
       (bind-keys :map jjin-term-map
                  ("t" . multi-term)
                  ("n" . multi-term-next)
                  ("p" . multi-term-prev)
                  ("d" . multi-term-dedicated-toggle))

       (setq term-bind-key-alist
             '(("C-c C-k" . term-line-mode)
               ("M-]" . multi-term-next)
               ("M-[" . multi-term-prev)
               ("C-c C-c" . term-interrupt-subjob)
               ("C-c C-e" . term-send-esc)
               ("C-m" . term-send-return)
               ("C-y" . term-paste)
               ("M-f" . term-send-forward-word)
               ("M-b" . term-send-backward-word)
               ("M-o" . term-send-backspace)
               ("M-p" . term-send-up)
               ("M-n" . term-send-down)
               ("M-M" . term-send-forward-kill-word)
               ("M-N" . term-send-backward-kill-word)
               ("<M-backspace>" . term-send-backward-kill-word)
               ("M-r" . term-send-reverse-search-history)
               ("M-," . term-send-raw)
               ("M-." . comint-dynamic-complete))))
   #+END_SRC

