index.html

<div id="outline-container-org2062ab3" class="outline-3">
<h3 id="org2062ab3"><span class="section-number-3">5.19</span> <code>helm</code></h3>
<div class="outline-text-3" id="text-5-19">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #81A1C1;">use-package</span> <span style="color: #81A1C1;">helm</span>
  <span style="color: #81A1C1;">:straight</span> t
  <span style="color: #81A1C1;">:demand</span> t
  <span style="color: #81A1C1;">:diminish</span> helm-mode
  <span style="color: #81A1C1;">:bind</span> ((<span style="color: #A3BE8C;">"C-x m"</span>    . helm-M-x)
          (<span style="color: #A3BE8C;">"C-x C-f"</span> . helm-find-files)
          (<span style="color: #A3BE8C;">"C-x b"</span>   . helm-buffers-list))
  <span style="color: #81A1C1;">:init</span>
  (<span style="color: #81A1C1;">setq</span> helm-external-programs-associations `((<span style="color: #A3BE8C;">"pdf"</span> . ,(<span style="color: #81A1C1;">if</span> (eq system-type 'darwin) <span style="color: #A3BE8C;">"open"</span> <span style="color: #A3BE8C;">"zathura"</span>))))
  (<span style="color: #81A1C1;">setq</span> helm-split-window-inside-p t)

  (<span style="color: #81A1C1;">setq</span> helm-mode-fuzzy-match t)

  <span style="color: #81A1C1;">:config</span>
  (helm-mode 1)
  (helm-autoresize-mode t)

  (<span style="color: #81A1C1;">defvar</span> <span style="color: #D8DEE9;">helm-source-file-not-found</span>
    (<span style="color: #81A1C1;">helm-build-dummy-source</span>
        <span style="color: #A3BE8C;">"Create file"</span>
      <span style="color: #81A1C1;">:action</span>
      (<span style="color: #81A1C1;">lambda</span> (c) (find-file c))))

  (<span style="color: #81A1C1;">bind-keys</span> <span style="color: #81A1C1;">:map</span> jjin-vc-map
             (<span style="color: #A3BE8C;">"g"</span> . helm-grep-do-git-grep))

  <span style="color: #616e88;">;; </span><span style="color: #616e88;">(bind-key "C-c C-j" 'helm-org-in-buffer-headings org-mode-map)</span>

  )

(<span style="color: #81A1C1;">use-package</span> <span style="color: #81A1C1;">helm-make</span>
  <span style="color: #81A1C1;">:straight</span> t
  <span style="color: #81A1C1;">:commands</span> helm-make-projectile
  <span style="color: #81A1C1;">:init</span>
  (<span style="color: #81A1C1;">setq</span> helm-make-cache-targets t)
  (<span style="color: #81A1C1;">setq</span> helm-make-list-target-method 'qp))

(<span style="color: #81A1C1;">use-package</span> <span style="color: #81A1C1;">helm-projectile</span>
  <span style="color: #81A1C1;">:after</span> projectile
  <span style="color: #81A1C1;">:bind</span> (<span style="color: #81A1C1;">:map</span> projectile-command-map
             (<span style="color: #A3BE8C;">"p"</span>   . helm-projectile)
             (<span style="color: #A3BE8C;">"a"</span>   . helm-projectile-find-other-file)
             (<span style="color: #A3BE8C;">"f"</span>   . helm-projectile-find-file)
             (<span style="color: #A3BE8C;">"F"</span>   . helm-projectile-find-file-in-known-projects)
             (<span style="color: #A3BE8C;">"s s"</span> . helm-projectile-ag)
             (<span style="color: #A3BE8C;">"s g"</span> . helm-projectile-grep))
  <span style="color: #81A1C1;">:straight</span> t
  <span style="color: #81A1C1;">:config</span>
  (add-to-list 'helm-projectile-sources-list helm-source-file-not-found t))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgabb670a" class="outline-3">
<h3 id="orgabb670a"><span class="section-number-3">5.20</span> <code>linum</code></h3>
<div class="outline-text-3" id="text-5-20">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #81A1C1;">use-package</span> <span style="color: #81A1C1;">linum</span>
  <span style="color: #81A1C1;">:straight</span> t
  <span style="color: #81A1C1;">:config</span>
  (<span style="color: #81A1C1;">setq</span> linum-format 'dynamic)
  (global-linum-mode 1)

  (<span style="color: #81A1C1;">defconst</span> <span style="color: #D8DEE9;">linum-mode-whitelist</span>
    '(prog-mode))

  (<span style="color: #81A1C1;">require</span> '<span style="color: #81A1C1;">mode-local</span>)

  (<span style="color: #81A1C1;">defadvice</span> <span style="color: #88C0D0;">linum-mode</span> (around linum-mode-selective activate)
    <span style="color: #616e88;">"Avoids enabling of linum-mode in the buffer having major mode set to one</span>
<span style="color: #616e88;">of listed in `</span><span style="color: #81A1C1;">linum-mode-excludes</span><span style="color: #616e88;">'."</span>
    (<span style="color: #81A1C1;">if</span> (<span style="color: #81A1C1;">or</span> (member major-mode linum-mode-whitelist)
            (member (get-mode-local-parent major-mode) linum-mode-whitelist))
      ad-do-it)))
</pre>
</div>
</div>
</div>

<div id="outline-container-org060a9a2" class="outline-3">
<h3 id="org060a9a2"><span class="section-number-3">5.21</span> <code>multi-term</code></h3>
<div class="outline-text-3" id="text-5-21">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #81A1C1;">use-package</span> <span style="color: #81A1C1;">multi-term</span>
  <span style="color: #81A1C1;">:straight</span> t
  <span style="color: #81A1C1;">:config</span>
  (<span style="color: #81A1C1;">bind-keys</span> <span style="color: #81A1C1;">:map</span> jjin-term-map
             (<span style="color: #A3BE8C;">"t"</span> . multi-term)
             (<span style="color: #A3BE8C;">"n"</span> . multi-term-next)
             (<span style="color: #A3BE8C;">"p"</span> . multi-term-prev)
             (<span style="color: #A3BE8C;">"d"</span> . multi-term-dedicated-toggle))

  (<span style="color: #81A1C1;">setq</span> term-bind-key-alist
        '((<span style="color: #A3BE8C;">"C-c C-k"</span> . term-line-mode)
          (<span style="color: #A3BE8C;">"M-]"</span> . multi-term-next)
          (<span style="color: #A3BE8C;">"M-["</span> . multi-term-prev)
          (<span style="color: #A3BE8C;">"C-c C-c"</span> . term-interrupt-subjob)
          (<span style="color: #A3BE8C;">"C-c C-e"</span> . term-send-esc)
          (<span style="color: #A3BE8C;">"C-m"</span> . term-send-return)
          (<span style="color: #A3BE8C;">"C-y"</span> . term-paste)
          (<span style="color: #A3BE8C;">"M-f"</span> . term-send-forward-word)
          (<span style="color: #A3BE8C;">"M-b"</span> . term-send-backward-word)
          (<span style="color: #A3BE8C;">"M-o"</span> . term-send-backspace)
          (<span style="color: #A3BE8C;">"M-p"</span> . term-send-up)
          (<span style="color: #A3BE8C;">"M-n"</span> . term-send-down)
          (<span style="color: #A3BE8C;">"M-M"</span> . term-send-forward-kill-word)
          (<span style="color: #A3BE8C;">"M-N"</span> . term-send-backward-kill-word)
          (<span style="color: #A3BE8C;">"&lt;M-backspace&gt;"</span> . term-send-backward-kill-word)
          (<span style="color: #A3BE8C;">"M-r"</span> . term-send-reverse-search-history)
          (<span style="color: #A3BE8C;">"M-,"</span> . term-send-raw)
          (<span style="color: #A3BE8C;">"M-."</span> . comint-dynamic-complete))))
</pre>
</div>
</div>
</div>
