README.org
** =mu4e=

   #+BEGIN_SRC emacs-lisp
     (use-package mu4e
       :ensure-system-package
       ((mu . mu)
        (offlineimap . offlineimap)
        (w3m . w3m))
       :commands (mu4e mu4e-update-mail-and-index)
       :init
       (defhydra jjin-hydra-mu4e (:exit t)
         "Auxiliary commands for mu4e"
         ("m" mu4e-update-mail-and-index "update"))

       (with-eval-after-load 'helm-exec
         (helm-exec-register-executable 'mu4e
                                        :alt 'jjin-hydra-mu4e/body))

       (setq mu4e-context-policy 'pick-first)
       (setq mu4e-headers-include-related nil)

       :config
       (when (eq system-type 'darwin)
         (setq mu4e-mu-binary "/usr/local/bin/mu"))

       ;; make sure the gnutls command line utils are installed
       ;; (require 'smtpmail)

       (setq
        message-send-mail-function 'smtpmail-send-it
        smtpmail-stream-type 'starttls
        smtpmail-default-smtp-server "smtp.gmail.com"
        smtpmail-smtp-server "smtp.gmail.com"
        smtpmail-smtp-service 587)

       (setq
        mu4e-maildir "~/mail"

        mu4e-drafts-folder "/personal/drafts"
        mu4e-sent-folder   "/personal/sent")

       ;; don't save message to Sent Messages, Gmail/IMAP takes care of this
       ;; (See the documentation for `mu4e-sent-messages-behavior' if you have
       ;; additional non-Gmail addresses and want assign them different
       ;; behavior.)
       (setq mu4e-sent-messages-behavior 'delete)

       (setq mu4e-maildir-shortcuts
             '(("/personal/INBOX"   . ?i)
               ("/personal/sent"    . ?s)
               ("/personal/drafts"  . ?d)
               ("/personal/archive" . ?a)
               ("/work/INBOX" . ?I)
               ("/work/sent" . ?S)
               ("/work/drafts" . ?D)
               ("/work/archive" . ?A)))

       (setq mu4e-get-mail-command
             (if (not (executable-find "offlineimap"))
                 "true" 
               "offlineimap"))

       ;; don't keep message buffers around
       (setq message-kill-buffer-on-exit t)

       (setq
        ;; FIXME: if w3m not installed:
        ;; - log it
        ;; - leave as default
        mu4e-html-renderer 'w3m
        mu4e-html2text-command "w3m -dump -T text/html")

       (add-hook 'mu4e-view-mode-hook 'visual-line-mode)

       (use-package gnus-dired
         :config
         ;; make the `gnus-dired-mail-buffers' function also work on message-mode derived
         ;; modes, such as mu4e-compose-mode
         (defun gnus-dired-mail-buffers ()
           (let (buffers)
             (save-current-buffer
               (dolist (buffer (buffer-list t))
                 (set-buffer buffer)
                 (when (and (derived-mode-p 'message-mode)
                            (null message-sent-message-via))
                   (push (buffer-name buffer) buffers))))
             (nreverse buffers)))

         (setq gnus-dired-mail-mode 'mu4e-user-agent)
         (add-hook 'dired-mode-hook 'turn-on-gnus-dired-mode))

       (set-face-attribute 'mu4e-header-highlight-face nil :underline nil)

       (setq mu4e-compose-signature-auto-include nil)

       (setq mail-user-agent 'mu4e-user-agent)

       (add-to-list 'mu4e-view-actions
                    '("View in browser" . mu4e-action-view-in-browser)
                    t)
       (add-to-list 'mu4e-view-actions
                    '("Capture message" . mu4e-action-capture-message)
                    t)

       (setq mu4e-update-interval nil)
       (setq mu4e-headers-skip-duplicates t)
       (setq mu4e-view-show-images t)

       (defun mu4e-message-maildir-matches (msg rx)
         (when rx
           (if (listp rx)
               ;; if rx is a list, try each one for a match
               (or (mu4e-message-maildir-matches msg (car rx))
                   (mu4e-message-maildir-matches msg (cdr rx)))
             ;; not a list, check rx
             (string-match rx (mu4e-message-field msg :maildir)))))

       (setq mu4e-contexts
             `(,(make-mu4e-context
                 :name "personal"
                 :match-func
                 (lambda (msg)
                   (when msg
                     (or
                      (mu4e-message-maildir-matches msg "^/personal")
                      (mu4e-message-contact-field-matches msg :to "jjin082693@gmail.com"))))
                 :vars `((user-mail-address . "jjin082693@gmail.com")
                         (mu4e-compose-signature
                          . ,(concat "Jonathan Jin\n"
                                     "Machine Learning Software Engineer, Twitter Cortex\n"
                                     "jjin.info"))
                         (smtpmail-smtp-user . "jjin082693@gmail.com")
                         (user-full-name . "Jonathan Jin")
                         (mu4e-trash-folder . "/personal/trash")
                         (mu4e-drafts-folder . "/personal/drafts")
                         (mu4e-refile-folder . "/personal/archive")))

                  ,(make-mu4e-context
                    :name "work"
                    :match-func
                    (lambda (msg)
                      (when msg
                        (or
                         (mu4e-message-maildir-matches msg "^/work")
                         (mu4e-message-contact-field-matches msg :to "jonathanj@twitter.com"))))
                    :vars `((user-mail-address . "jonathanj@twitter.com")
                            (mu4e-compose-signature
                             . ,(concat "Jonathan Jin\n"
                                        "Software Engineer, ML Platform Tools, Cortex"))
                            (smtpmail-smtp-user . "jonathanj@twitter.com")
                            (user-full-name . "Jonathan Jin")
                            (mu4e-trash-folder . "/work/trash")
                            (mu4e-drafts-folder . "/work/drafts")
                            (mu4e-refile-folder . "/work/archive")))))

       (setq mu4e-compose-context-policy 'ask)

       ;; Sets `mu4e-user-mail-address-list' to the concatenation of all
       ;; `user-mail-address' values for all contexts. If you have other mail
       ;; addresses as well, you'll need to add those manually.
       (setq mu4e-user-mail-address-list
             (delq nil
                   (mapcar (lambda (context)
                             (when (mu4e-context-vars context)
                               (cdr (assq 'user-mail-address (mu4e-context-vars context)))))
                           mu4e-contexts)))

       (setq mu4e-view-show-addresses t)

       (add-to-list 'mu4e-bookmarks
                    '("(maildir:\"/personal/INBOX\" OR maildir:\"/work/INBOX\") flag:unread"
                      "Unread INBOXes"
                      ?U)
                    t)

       (add-hook 'mu4e-view-mode-hook 'mu4e-view-fill-long-lines))
   #+END_SRC

