index.html

<div id="outline-container-orge1783e7" class="outline-3">
<h3 id="orge1783e7"><span class="section-number-3">5.22</span> <code>mu4e</code></h3>
<div class="outline-text-3" id="text-5-22">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #81A1C1;">use-package</span> <span style="color: #81A1C1;">mu4e</span>
  <span style="color: #81A1C1;">:ensure-system-package</span>
  ((mu . mu)
   (offlineimap . offlineimap)
   (w3m . w3m))
  <span style="color: #81A1C1;">:commands</span> (mu4e mu4e-update-mail-and-index)
  <span style="color: #81A1C1;">:init</span>
  (<span style="color: #81A1C1;">defhydra</span> jjin-hydra-mu4e (<span style="color: #81A1C1;">:exit</span> t)
    <span style="color: #616e88;">"Auxiliary commands for mu4e"</span>
    (<span style="color: #A3BE8C;">"m"</span> mu4e-update-mail-and-index <span style="color: #A3BE8C;">"update"</span>))

  (<span style="color: #81A1C1;">with-eval-after-load</span> 'helm-exec
    (helm-exec-register-executable 'mu4e
                                   <span style="color: #81A1C1;">:alt</span> 'jjin-hydra-mu4e/body))

  (<span style="color: #81A1C1;">setq</span> mu4e-context-policy 'pick-first)
  (<span style="color: #81A1C1;">setq</span> mu4e-headers-include-related nil)

  <span style="color: #81A1C1;">:config</span>
  (<span style="color: #81A1C1;">when</span> (eq system-type 'darwin)
    (<span style="color: #81A1C1;">setq</span> mu4e-mu-binary <span style="color: #A3BE8C;">"/usr/local/bin/mu"</span>))

  <span style="color: #616e88;">;; </span><span style="color: #616e88;">make sure the gnutls command line utils are installed</span>
  <span style="color: #616e88;">;; </span><span style="color: #616e88;">(require 'smtpmail)</span>

  (<span style="color: #81A1C1;">setq</span>
   message-send-mail-function 'smtpmail-send-it
   smtpmail-stream-type 'starttls
   smtpmail-default-smtp-server <span style="color: #A3BE8C;">"smtp.gmail.com"</span>
   smtpmail-smtp-server <span style="color: #A3BE8C;">"smtp.gmail.com"</span>
   smtpmail-smtp-service 587)

  (<span style="color: #81A1C1;">setq</span>
   mu4e-maildir <span style="color: #A3BE8C;">"~/mail"</span>

   mu4e-drafts-folder <span style="color: #A3BE8C;">"/personal/drafts"</span>
   mu4e-sent-folder   <span style="color: #A3BE8C;">"/personal/sent"</span>)

  <span style="color: #616e88;">;; </span><span style="color: #616e88;">don't save message to Sent Messages, Gmail/IMAP takes care of this</span>
  <span style="color: #616e88;">;; </span><span style="color: #616e88;">(See the documentation for `</span><span style="color: #81A1C1;">mu4e-sent-messages-behavior</span><span style="color: #616e88;">' if you have</span>
  <span style="color: #616e88;">;; </span><span style="color: #616e88;">additional non-Gmail addresses and want assign them different</span>
  <span style="color: #616e88;">;; </span><span style="color: #616e88;">behavior.)</span>
  (<span style="color: #81A1C1;">setq</span> mu4e-sent-messages-behavior 'delete)

  (<span style="color: #81A1C1;">setq</span> mu4e-maildir-shortcuts
        '((<span style="color: #A3BE8C;">"/personal/INBOX"</span>   . ?i)
          (<span style="color: #A3BE8C;">"/personal/sent"</span>    . ?s)
          (<span style="color: #A3BE8C;">"/personal/drafts"</span>  . ?d)
          (<span style="color: #A3BE8C;">"/personal/archive"</span> . ?a)
          (<span style="color: #A3BE8C;">"/work/INBOX"</span> . ?I)
          (<span style="color: #A3BE8C;">"/work/sent"</span> . ?S)
          (<span style="color: #A3BE8C;">"/work/drafts"</span> . ?D)
          (<span style="color: #A3BE8C;">"/work/archive"</span> . ?A)))

  (<span style="color: #81A1C1;">setq</span> mu4e-get-mail-command
        (<span style="color: #81A1C1;">if</span> (not (executable-find <span style="color: #A3BE8C;">"offlineimap"</span>))
            <span style="color: #A3BE8C;">"true"</span> 
          <span style="color: #A3BE8C;">"offlineimap"</span>))

  <span style="color: #616e88;">;; </span><span style="color: #616e88;">don't keep message buffers around</span>
  (<span style="color: #81A1C1;">setq</span> message-kill-buffer-on-exit t)

  (<span style="color: #81A1C1;">setq</span>
   <span style="color: #616e88;">;; </span><span style="color: #616e88;">FIXME: if w3m not installed:</span>
   <span style="color: #616e88;">;; </span><span style="color: #616e88;">- log it</span>
   <span style="color: #616e88;">;; </span><span style="color: #616e88;">- leave as default</span>
   mu4e-html-renderer 'w3m
   mu4e-html2text-command <span style="color: #A3BE8C;">"w3m -dump -T text/html"</span>)

  (add-hook 'mu4e-view-mode-hook 'visual-line-mode)

  (<span style="color: #81A1C1;">use-package</span> <span style="color: #81A1C1;">gnus-dired</span>
    <span style="color: #81A1C1;">:config</span>
    <span style="color: #616e88;">;; </span><span style="color: #616e88;">make the `</span><span style="color: #81A1C1;">gnus-dired-mail-buffers</span><span style="color: #616e88;">' function also work on message-mode derived</span>
    <span style="color: #616e88;">;; </span><span style="color: #616e88;">modes, such as mu4e-compose-mode</span>
    (<span style="color: #81A1C1;">defun</span> <span style="color: #88C0D0;">gnus-dired-mail-buffers</span> ()
      (<span style="color: #81A1C1;">let</span> (buffers)
        (<span style="color: #81A1C1;">save-current-buffer</span>
          (<span style="color: #81A1C1;">dolist</span> (buffer (buffer-list t))
            (set-buffer buffer)
            (<span style="color: #81A1C1;">when</span> (<span style="color: #81A1C1;">and</span> (derived-mode-p 'message-mode)
                       (null message-sent-message-via))
              (<span style="color: #81A1C1;">push</span> (buffer-name buffer) buffers))))
        (nreverse buffers)))

    (<span style="color: #81A1C1;">setq</span> gnus-dired-mail-mode 'mu4e-user-agent)
    (add-hook 'dired-mode-hook 'turn-on-gnus-dired-mode))

  (set-face-attribute 'mu4e-header-highlight-face nil <span style="color: #81A1C1;">:underline</span> nil)

  (<span style="color: #81A1C1;">setq</span> mu4e-compose-signature-auto-include nil)

  (<span style="color: #81A1C1;">setq</span> mail-user-agent 'mu4e-user-agent)

  (add-to-list 'mu4e-view-actions
               '(<span style="color: #A3BE8C;">"View in browser"</span> . mu4e-action-view-in-browser)
               t)
  (add-to-list 'mu4e-view-actions
               '(<span style="color: #A3BE8C;">"Capture message"</span> . mu4e-action-capture-message)
               t)

  (<span style="color: #81A1C1;">setq</span> mu4e-update-interval nil)
  (<span style="color: #81A1C1;">setq</span> mu4e-headers-skip-duplicates t)
  (<span style="color: #81A1C1;">setq</span> mu4e-view-show-images t)

  (<span style="color: #81A1C1;">defun</span> <span style="color: #88C0D0;">mu4e-message-maildir-matches</span> (msg rx)
    (<span style="color: #81A1C1;">when</span> rx
      (<span style="color: #81A1C1;">if</span> (listp rx)
          <span style="color: #616e88;">;; </span><span style="color: #616e88;">if rx is a list, try each one for a match</span>
          (<span style="color: #81A1C1;">or</span> (mu4e-message-maildir-matches msg (car rx))
              (mu4e-message-maildir-matches msg (cdr rx)))
        <span style="color: #616e88;">;; </span><span style="color: #616e88;">not a list, check rx</span>
        (string-match rx (mu4e-message-field msg <span style="color: #81A1C1;">:maildir</span>)))))

  (<span style="color: #81A1C1;">setq</span> mu4e-contexts
        `(,(make-mu4e-context
            <span style="color: #81A1C1;">:name</span> <span style="color: #A3BE8C;">"personal"</span>
            <span style="color: #81A1C1;">:match-func</span>
            (<span style="color: #81A1C1;">lambda</span> (msg)
              (<span style="color: #81A1C1;">when</span> msg
                (<span style="color: #81A1C1;">or</span>
                 (mu4e-message-maildir-matches msg <span style="color: #A3BE8C;">"^/personal"</span>)
                 (mu4e-message-contact-field-matches msg <span style="color: #81A1C1;">:to</span> <span style="color: #A3BE8C;">"jjin082693@gmail.com"</span>))))
            <span style="color: #81A1C1;">:vars</span> `((user-mail-address . <span style="color: #A3BE8C;">"jjin082693@gmail.com"</span>)
                    (mu4e-compose-signature
                     . ,(concat <span style="color: #A3BE8C;">"Jonathan Jin\n"</span>
                                <span style="color: #A3BE8C;">"Machine Learning Software Engineer, Twitter Cortex\n"</span>
                                <span style="color: #A3BE8C;">"jjin.info"</span>))
                    (smtpmail-smtp-user . <span style="color: #A3BE8C;">"jjin082693@gmail.com"</span>)
                    (user-full-name . <span style="color: #A3BE8C;">"Jonathan Jin"</span>)
                    (mu4e-trash-folder . <span style="color: #A3BE8C;">"/personal/trash"</span>)
                    (mu4e-drafts-folder . <span style="color: #A3BE8C;">"/personal/drafts"</span>)
                    (mu4e-refile-folder . <span style="color: #A3BE8C;">"/personal/archive"</span>)))

             ,(make-mu4e-context
               <span style="color: #81A1C1;">:name</span> <span style="color: #A3BE8C;">"work"</span>
               <span style="color: #81A1C1;">:match-func</span>
               (<span style="color: #81A1C1;">lambda</span> (msg)
                 (<span style="color: #81A1C1;">when</span> msg
                   (<span style="color: #81A1C1;">or</span>
                    (mu4e-message-maildir-matches msg <span style="color: #A3BE8C;">"^/work"</span>)
                    (mu4e-message-contact-field-matches msg <span style="color: #81A1C1;">:to</span> <span style="color: #A3BE8C;">"jonathanj@twitter.com"</span>))))
               <span style="color: #81A1C1;">:vars</span> `((user-mail-address . <span style="color: #A3BE8C;">"jonathanj@twitter.com"</span>)
                       (mu4e-compose-signature
                        . ,(concat <span style="color: #A3BE8C;">"Jonathan Jin\n"</span>
                                   <span style="color: #A3BE8C;">"Software Engineer, ML Platform Tools, Cortex"</span>))
                       (smtpmail-smtp-user . <span style="color: #A3BE8C;">"jonathanj@twitter.com"</span>)
                       (user-full-name . <span style="color: #A3BE8C;">"Jonathan Jin"</span>)
                       (mu4e-trash-folder . <span style="color: #A3BE8C;">"/work/trash"</span>)
                       (mu4e-drafts-folder . <span style="color: #A3BE8C;">"/work/drafts"</span>)
                       (mu4e-refile-folder . <span style="color: #A3BE8C;">"/work/archive"</span>)))))

  (<span style="color: #81A1C1;">setq</span> mu4e-compose-context-policy 'ask)

  <span style="color: #616e88;">;; </span><span style="color: #616e88;">Sets `</span><span style="color: #81A1C1;">mu4e-user-mail-address-list</span><span style="color: #616e88;">' to the concatenation of all</span>
  <span style="color: #616e88;">;; </span><span style="color: #616e88;">`</span><span style="color: #81A1C1;">user-mail-address</span><span style="color: #616e88;">' values for all contexts. If you have other mail</span>
  <span style="color: #616e88;">;; </span><span style="color: #616e88;">addresses as well, you'll need to add those manually.</span>
  (<span style="color: #81A1C1;">setq</span> mu4e-user-mail-address-list
        (delq nil
              (mapcar (<span style="color: #81A1C1;">lambda</span> (context)
                        (<span style="color: #81A1C1;">when</span> (mu4e-context-vars context)
                          (cdr (assq 'user-mail-address (mu4e-context-vars context)))))
                      mu4e-contexts)))

  (<span style="color: #81A1C1;">setq</span> mu4e-view-show-addresses t)

  (add-to-list 'mu4e-bookmarks
               '(<span style="color: #A3BE8C;">"(maildir:\"/personal/INBOX\" OR maildir:\"/work/INBOX\") flag:unread"</span>
                 <span style="color: #A3BE8C;">"Unread INBOXes"</span>
                 ?U)
               t)

  (add-hook 'mu4e-view-mode-hook 'mu4e-view-fill-long-lines))
</pre>
</div>
</div>
</div>
