index.html

<div id="outline-container-orge70e1bc" class="outline-3">
<h3 id="orge70e1bc"><span class="section-number-3">5.23</span> <code>org-mode</code></h3>
<div class="outline-text-3" id="text-5-23">
<p>
The following is a temporary hack until straight.el supports building Org,
see:
</p>

<ul class="org-ul">
<li><a href="https://github.com/raxod502/straight.el/issues/211">https://github.com/raxod502/straight.el/issues/211</a></li>
<li><a href="https://github.com/raxod502/radian/issues/410">https://github.com/raxod502/radian/issues/410</a></li>
</ul>

<p>
There are three things missing from our version of Org: the functions
<code>org-git-version</code> and <code>org-release</code>, and the feature <code>org-version</code>. We
provide all three of those ourself, therefore.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #81A1C1;">require</span> '<span style="color: #81A1C1;">subr-x</span>)
(straight-use-package 'git)

(<span style="color: #81A1C1;">defun</span> <span style="color: #88C0D0;">org-git-version</span> ()
  <span style="color: #616e88;">"The Git version of org-mode.</span>
<span style="color: #616e88;">Inserted by installing org-mode or when a release is made."</span>
  (<span style="color: #81A1C1;">require</span> '<span style="color: #81A1C1;">git</span>)
  (<span style="color: #81A1C1;">let</span> ((git-repo (expand-file-name
                   <span style="color: #A3BE8C;">"straight/repos/org/"</span> user-emacs-directory)))
    (string-trim
     (git-run <span style="color: #A3BE8C;">"describe"</span>
              <span style="color: #A3BE8C;">"--match=release</span><span style="color: #EBCB8B;">\</span><span style="color: #A3BE8C;">*"</span>
              <span style="color: #A3BE8C;">"--abbrev=6"</span>
              <span style="color: #A3BE8C;">"HEAD"</span>))))

(<span style="color: #81A1C1;">defun</span> <span style="color: #88C0D0;">org-release</span> ()
  <span style="color: #616e88;">"The release version of org-mode.</span>
<span style="color: #616e88;">Inserted by installing org-mode or when a release is made."</span>
  (<span style="color: #81A1C1;">require</span> '<span style="color: #81A1C1;">git</span>)
  (<span style="color: #81A1C1;">let</span> ((git-repo (expand-file-name
                   <span style="color: #A3BE8C;">"straight/repos/org/"</span> user-emacs-directory)))
    (string-trim
     (string-remove-prefix
      <span style="color: #A3BE8C;">"release_"</span>
      (git-run <span style="color: #A3BE8C;">"describe"</span>
               <span style="color: #A3BE8C;">"--match=release</span><span style="color: #EBCB8B;">\</span><span style="color: #A3BE8C;">*"</span>
               <span style="color: #A3BE8C;">"--abbrev=0"</span>
               <span style="color: #A3BE8C;">"HEAD"</span>)))))

(<span style="color: #81A1C1;">provide</span> '<span style="color: #81A1C1;">org-version</span>)
</pre>
</div>

<p>
The following is the <b>actual</b> configuration.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #81A1C1;">use-package</span> <span style="color: #81A1C1;">org</span>
  <span style="color: #81A1C1;">:bind</span> (<span style="color: #81A1C1;">:map</span> org-mode-map
         (<span style="color: #A3BE8C;">"RET"</span> . org-return-indent)
         (<span style="color: #A3BE8C;">"M-p"</span> . outline-previous-visible-heading)
         (<span style="color: #A3BE8C;">"M-n"</span> . outline-next-visible-heading)
         (<span style="color: #A3BE8C;">"s-t"</span> . org-todo))
  <span style="color: #81A1C1;">:straight</span> org-plus-contrib
  <span style="color: #81A1C1;">:mode</span> (<span style="color: #A3BE8C;">"\\.org$"</span> . org-mode)
  <span style="color: #81A1C1;">:init</span>
  (<span style="color: #81A1C1;">setq</span> org-special-ctrl-a/e t)
  (<span style="color: #81A1C1;">setq</span> org-return-follows-link t)

  (<span style="color: #81A1C1;">setq</span> org-export-dispatch-use-expert-ui t)

  (<span style="color: #81A1C1;">setq</span> org-latex-create-formula-image-program 'imagemagick)
  (<span style="color: #81A1C1;">setq</span> org-latex-listings 'minted)
  (<span style="color: #81A1C1;">setq</span> org-tags-column -80)

  (<span style="color: #81A1C1;">setq</span> org-enforce-todo-dependencies t)
  (<span style="color: #81A1C1;">setq</span> org-enforce-todo-checkbox-dependencies  t)

  (<span style="color: #81A1C1;">setq</span> org-pretty-entities t)
  (<span style="color: #81A1C1;">setq</span> org-src-fontify-natively t)
  (<span style="color: #81A1C1;">setq</span> org-list-allow-alphabetical t)

  (<span style="color: #81A1C1;">setq</span> org-deadline-warning-days 7)

  (<span style="color: #81A1C1;">setq</span> org-agenda-custom-commands
        '((<span style="color: #A3BE8C;">"s"</span> <span style="color: #A3BE8C;">"Schoolwork"</span>
           ((agenda <span style="color: #A3BE8C;">""</span> ((org-agenda-ndays 14)
                        (org-agenda-start-on-weekday nil)
                        (org-agenda-prefix-format <span style="color: #A3BE8C;">" %-12:c%?-12t% s"</span>)))
            (tags-todo <span style="color: #A3BE8C;">"CATEGORY=\"Schoolwork\""</span>
                       ((org-agenda-prefix-format <span style="color: #A3BE8C;">"%b"</span>)))))

          (<span style="color: #A3BE8C;">"r"</span> <span style="color: #A3BE8C;">"Reading"</span>
           ((tags-todo <span style="color: #A3BE8C;">"CATEGORY=\"Reading\""</span>
                       ((org-agenda-prefix-format <span style="color: #A3BE8C;">"%:T "</span>)))))
          (<span style="color: #A3BE8C;">"m"</span> <span style="color: #A3BE8C;">"Movies"</span>
           ((tags-todo <span style="color: #A3BE8C;">"CATEGORY=\"Movies\""</span>
                       ((org-agenda-prefix-format <span style="color: #A3BE8C;">"%:T "</span>)))))))
    (<span style="color: #81A1C1;">setq</span>
     org-latex-pdf-process (list <span style="color: #A3BE8C;">"latexmk -shell-escape -pdf %f"</span>)

    org-entities-user
    '((<span style="color: #A3BE8C;">"supsetneqq"</span> <span style="color: #A3BE8C;">"\\supsetneqq"</span> t <span style="color: #A3BE8C;">""</span> <span style="color: #A3BE8C;">"[superset of above not equal to]"</span>
       <span style="color: #A3BE8C;">"[superset of above not equal to]"</span> <span style="color: #A3BE8C;">"&#10956;"</span>)
      (<span style="color: #A3BE8C;">"subseteq"</span> <span style="color: #A3BE8C;">"\\subseteq"</span> t <span style="color: #A3BE8C;">""</span> <span style="color: #A3BE8C;">"[subset of above equal to]"</span> <span style="color: #A3BE8C;">"subset of above equal to"</span> <span style="color: #A3BE8C;">"&#8838;"</span>)
       (<span style="color: #A3BE8C;">"subsetneqq"</span> <span style="color: #A3BE8C;">"\\subsetneqq"</span> t <span style="color: #A3BE8C;">""</span> <span style="color: #A3BE8C;">"[suberset of above not equal to]"</span>
         <span style="color: #A3BE8C;">"[suberset of above not equal to]"</span> <span style="color: #A3BE8C;">"&#10955;"</span>)))

  <span style="color: #81A1C1;">:config</span>
  (<span style="color: #81A1C1;">setq</span> org-agenda-files '(<span style="color: #A3BE8C;">"~/agenda/"</span>))
  (plist-put org-format-latex-options <span style="color: #81A1C1;">:scale</span> 1.5)

  (<span style="color: #81A1C1;">setq</span> org-latex-packages-alist
    '((<span style="color: #A3BE8C;">""</span> <span style="color: #A3BE8C;">"minted"</span>) (<span style="color: #A3BE8C;">"usenames,dvipsnames,svgnames"</span> <span style="color: #A3BE8C;">"xcolor"</span>)))

  (<span style="color: #81A1C1;">defun</span> <span style="color: #88C0D0;">my-org-autodone</span> (n-done n-not-done)
    <span style="color: #616e88;">"Switch entry to DONE when all subentries are done, to TODO otherwise."</span>
    (<span style="color: #81A1C1;">let</span> (org-log-done org-log-states)   <span style="color: #616e88;">; </span><span style="color: #616e88;">turn off logging</span>
      (org-todo (<span style="color: #81A1C1;">if</span> (= n-not-done 0) <span style="color: #A3BE8C;">"DONE"</span> <span style="color: #A3BE8C;">"TODO"</span>))))

  (add-hook 'org-after-todo-statistics-hook 'my-org-autodone)

  (org-babel-do-load-languages
    'org-babel-load-languages
    '((emacs-lisp . t)
       (latex     . t)
       (python    . t)
       <span style="color: #616e88;">;; </span><span style="color: #616e88;">FIXME: Make this contingent on ob-ipython</span>
       <span style="color: #616e88;">;; </span><span style="color: #616e88;">(ipython   . t)</span>
       (R         . t)
       (octave    . t)
       (matlab    . t)
       (shell     . t)))

  (<span style="color: #81A1C1;">setq</span> org-confirm-babel-evaluate nil)
  (<span style="color: #81A1C1;">setq</span> org-export-use-babel t)

  (<span style="color: #81A1C1;">setq</span> org-latex-minted-options
    '((<span style="color: #A3BE8C;">"linenos"</span> <span style="color: #A3BE8C;">"true"</span>)
       (<span style="color: #A3BE8C;">"fontsize"</span> <span style="color: #A3BE8C;">"\\scriptsize"</span>)
       (<span style="color: #A3BE8C;">"frame"</span> <span style="color: #A3BE8C;">"lines"</span>)))

  (<span style="color: #81A1C1;">setq</span> org-export-latex-hyperref-format <span style="color: #A3BE8C;">"\\ref{%s}"</span>)

  (<span style="color: #81A1C1;">setq</span>
    org-src-window-setup 'current-window
    org-agenda-window-setup 'current-window)

  (<span style="color: #81A1C1;">setq</span> org-blank-before-new-entry
    '((heading . true)
       (plain-list-item . auto)))

  <span style="color: #616e88;">;; </span><span style="color: #616e88;">FIXME: parameter-ize dir `</span><span style="color: #81A1C1;">agenda</span><span style="color: #616e88;">'</span>
  (<span style="color: #81A1C1;">setq</span> org-default-notes-file <span style="color: #A3BE8C;">"~/agenda/notes.org"</span>)

  (<span style="color: #81A1C1;">setq</span> org-capture-templates
        `((<span style="color: #A3BE8C;">"r"</span> <span style="color: #A3BE8C;">"Reading"</span> entry (file <span style="color: #A3BE8C;">"~/proj/lists/read.org"</span>)
           <span style="color: #A3BE8C;">"* TODO %?\n  Entered on %U\n  %i"</span>)
          (<span style="color: #A3BE8C;">"t"</span> <span style="color: #A3BE8C;">"Task"</span> entry (file <span style="color: #A3BE8C;">""</span>)
           <span style="color: #A3BE8C;">"* TODO %?\n %i"</span>)))

  (<span style="color: #81A1C1;">setq</span> org-refile-targets '((nil . (<span style="color: #81A1C1;">:maxlevel</span> . 10))))

  (<span style="color: #81A1C1;">setq</span> org-export-with-smart-quotes t)
  (<span style="color: #81A1C1;">with-eval-after-load</span> 'ace-link
    <span style="color: #616e88;">;; </span><span style="color: #616e88;">(bind-keys :map org-agenda-mode-map</span>
    <span style="color: #616e88;">;;            </span><span style="color: #616e88;">("M-o" . ace-link-org))</span>
    (<span style="color: #81A1C1;">bind-keys</span> <span style="color: #81A1C1;">:map</span> org-mode-map
               (<span style="color: #A3BE8C;">"M-o"</span> . ace-link-org))))

(<span style="color: #81A1C1;">use-package</span> <span style="color: #81A1C1;">ox-latex</span>
  <span style="color: #81A1C1;">:after</span> org)

(<span style="color: #81A1C1;">use-package</span> <span style="color: #81A1C1;">ox-bibtex</span>
  <span style="color: #81A1C1;">:after</span> org)

(<span style="color: #81A1C1;">use-package</span> <span style="color: #81A1C1;">ox-md</span>
  <span style="color: #81A1C1;">:after</span> org)

(<span style="color: #81A1C1;">use-package</span> <span style="color: #81A1C1;">ob-python</span>
  <span style="color: #81A1C1;">:after</span> org
  <span style="color: #81A1C1;">:init</span>
  (<span style="color: #81A1C1;">setq</span> org-babel-python-command <span style="color: #A3BE8C;">"python3"</span>))

(<span style="color: #81A1C1;">use-package</span> <span style="color: #81A1C1;">toc-org</span>
  <span style="color: #81A1C1;">:disabled</span> t
  <span style="color: #81A1C1;">:after</span> org
  <span style="color: #81A1C1;">:config</span>
  (add-hook 'org-mode-hook 'toc-org-enable))

(<span style="color: #81A1C1;">use-package</span> <span style="color: #81A1C1;">evil-org</span>
  <span style="color: #81A1C1;">:straight</span> t
  <span style="color: #81A1C1;">:after</span> (evil org)
  <span style="color: #81A1C1;">:config</span>
  (add-hook 'org-mode-hook 'evil-org-mode)
  (evil-org-set-key-theme)
  (<span style="color: #81A1C1;">setq</span> evil-org-special-o/O '(table-row)))

(<span style="color: #81A1C1;">use-package</span> <span style="color: #81A1C1;">org-tempo</span>
  <span style="color: #81A1C1;">:after</span> org)
</pre>
</div>
</div>
</div>
