index.html

<div id="outline-container-org116d2c2" class="outline-3">
<h3 id="org116d2c2"><span class="section-number-3">5.24</span> Org-page</h3>
<div class="outline-text-3" id="text-5-24">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #81A1C1;">use-package</span> <span style="color: #81A1C1;">org-page</span>
<span style="color: #81A1C1;">:after</span> org
<span style="color: #81A1C1;">:straight</span> t)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfc89dac" class="outline-3">
<h3 id="orgfc89dac"><span class="section-number-3">5.25</span> <code>pdf-tools</code></h3>
<div class="outline-text-3" id="text-5-25">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #81A1C1;">use-package</span> <span style="color: #81A1C1;">pdf-tools</span>
  <span style="color: #81A1C1;">:straight</span> t
  <span style="color: #81A1C1;">:mode</span> (<span style="color: #A3BE8C;">"\\.pdf$"</span> . pdf-view-mode)
  <span style="color: #81A1C1;">:config</span>
  (pdf-tools-install)

  (<span style="color: #81A1C1;">let</span> ((foreground-orig (car pdf-view-midnight-colors)))
    (<span style="color: #81A1C1;">setq</span> pdf-view-midnight-colors
          (cons <span style="color: #A3BE8C;">"white"</span> <span style="color: #A3BE8C;">"black"</span>)))

  (<span style="color: #81A1C1;">with-eval-after-load</span> 'evil
      (<span style="color: #81A1C1;">progn</span>
        (add-to-list 'evil-emacs-state-modes 'pdf-outline-buffer-mode)
        (add-to-list 'evil-emacs-state-modes 'pdf-view-mode))))
</pre>
</div>
</div>
</div>

<div id="outline-container-org34a2e22" class="outline-3">
<h3 id="org34a2e22"><span class="section-number-3">5.26</span> <code>projectile</code></h3>
<div class="outline-text-3" id="text-5-26">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #616e88;">;; </span><span style="color: #616e88;">TODO: For sake of Constant Reader, give some context as to why this might be</span>
<span style="color: #616e88;">;; </span><span style="color: #616e88;">necessary (at least for me)</span>
(<span style="color: #81A1C1;">defun</span> <span style="color: #88C0D0;">jjin/projectile-absolute-compilation-dir-maybe</span> ()
  <span style="color: #616e88;">"Returns the default compilation dir of the current Projectile project type if</span>
<span style="color: #616e88;">  it is an absolute path; otherwise, return nil."</span>
  (<span style="color: #81A1C1;">let*</span> ((type (projectile-project-type))
         (comp-dir (projectile-default-compilation-dir type)))
    (<span style="color: #81A1C1;">if</span> (<span style="color: #81A1C1;">and</span> comp-dir (file-name-absolute-p comp-dir)) comp-dir nil)))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #81A1C1;">use-package</span> <span style="color: #81A1C1;">projectile</span>
  <span style="color: #81A1C1;">:straight</span> t
  <span style="color: #81A1C1;">:diminish</span> projectile-mode
  <span style="color: #81A1C1;">:init</span>
  (<span style="color: #81A1C1;">setq</span> projectile-globally-ignored-files '(<span style="color: #A3BE8C;">"TAGS"</span>
                                            <span style="color: #A3BE8C;">"GPATH"</span>
                                            <span style="color: #A3BE8C;">"GRTAGS"</span>
                                            <span style="color: #A3BE8C;">"GSYMS"</span>
                                            <span style="color: #A3BE8C;">"GTAGS"</span>)
        projectile-globally-ignored-file-suffixes '(<span style="color: #A3BE8C;">"~"</span>))

  <span style="color: #616e88;">;; </span><span style="color: #616e88;">We'd like projects contained within other projects, e.g. packages pulled</span>
  <span style="color: #616e88;">;; </span><span style="color: #616e88;">into the .emacs.d/.straight dir via straight.el, to be recognized as</span>
  <span style="color: #616e88;">;; </span><span style="color: #616e88;">Projectile packages.</span>

  <span style="color: #616e88;">;; </span><span style="color: #616e88;">TODO: This doesn't play well with monorepo structures that might have</span>
  <span style="color: #616e88;">;; </span><span style="color: #616e88;">multiple "project root" files scattered throughout the codebase.</span>
  <span style="color: #616e88;">;; </span><span style="color: #616e88;">(setq projectile-project-root-files-functions</span>
  <span style="color: #616e88;">;;       </span><span style="color: #616e88;">'(projectile-root-local</span>
  <span style="color: #616e88;">;;         </span><span style="color: #616e88;">projectile-root-top-down</span>
  <span style="color: #616e88;">;;         </span><span style="color: #616e88;">projectile-root-top-down-recurring</span>
  <span style="color: #616e88;">;;         </span><span style="color: #616e88;">projectile-root-bottom-up))</span>

  <span style="color: #81A1C1;">:config</span>
  (define-key projectile-mode-map (kbd <span style="color: #A3BE8C;">"s-p"</span>) 'projectile-command-map)
  (advice-add 'projectile-compilation-dir
              <span style="color: #81A1C1;">:before-until</span>
              'jjin/projectile-absolute-compilation-dir-maybe)

  <span style="color: #616e88;">;; </span><span style="color: #616e88;">MacOS file system is case insensitive. This means that, when combined with</span>
  <span style="color: #616e88;">;; </span><span style="color: #616e88;">top-down root discovery, .git directory's `</span><span style="color: #81A1C1;">description</span><span style="color: #616e88;">' file conflicts with</span>
  <span style="color: #616e88;">;; </span><span style="color: #616e88;">the `</span><span style="color: #81A1C1;">DESCRIPTION</span><span style="color: #616e88;">' element -- intended for R projects -- in the default</span>
  <span style="color: #616e88;">;; </span><span style="color: #616e88;">value of `</span><span style="color: #81A1C1;">projectile-project-root-file</span><span style="color: #616e88;">'.</span>
  <span style="color: #616e88;">;;</span>
  <span style="color: #616e88;">;; </span><span style="color: #616e88;">Since I really don't use R and don't plan to anytime soon, removing it from</span>
  <span style="color: #616e88;">;; </span><span style="color: #616e88;">here. Can revisit if/when ever necessary.</span>
  (<span style="color: #81A1C1;">setq</span> projectile-project-root-files
        (remove <span style="color: #A3BE8C;">"DESCRIPTION"</span> projectile-project-root-files))
  (<span style="color: #81A1C1;">bind-key</span> <span style="color: #A3BE8C;">"&lt;f12&gt;"</span>
            (<span style="color: #81A1C1;">lambda</span> ()
              <span style="color: #616e88;">"Save all project buffers and compile"</span>
              (<span style="color: #81A1C1;">interactive</span>)
              (projectile-save-project-buffers)
              (<span style="color: #81A1C1;">let</span> (compilation-read-command)
                (projectile-compile-project nil)))
            projectile-mode-map)

  (<span style="color: #81A1C1;">bind-key</span> <span style="color: #A3BE8C;">"c"</span>
            (<span style="color: #81A1C1;">lambda</span> (arg)
              <span style="color: #616e88;">"Run `</span><span style="color: #81A1C1;">helm-make-projectile</span><span style="color: #616e88;">' if the package is</span>
<span style="color: #616e88;">installed and the project contains a Makefile. Otherwise,</span>
<span style="color: #616e88;">fallback to default, i.e. `</span><span style="color: #81A1C1;">projectile-compile-project</span><span style="color: #616e88;">'."</span>
              (<span style="color: #81A1C1;">interactive</span> <span style="color: #A3BE8C;">"P"</span>)
              (<span style="color: #81A1C1;">if</span> (<span style="color: #81A1C1;">and</span> (package-installed-p 'helm-make)
                       (file-exists-p (concat (projectile-project-root) <span style="color: #A3BE8C;">"Makefile"</span>)))
                  (helm-make-projectile (prefix-numeric-value arg))
                (projectile-compile-project arg)))
            projectile-command-map)

  (<span style="color: #81A1C1;">setq</span> projectile-enable-caching t)

  (<span style="color: #81A1C1;">with-eval-after-load</span> 'helm
      (<span style="color: #81A1C1;">setq</span> projectile-completion-system 'helm
            projectile-switch-project-action 'helm-projectile))

  (projectile-global-mode)

  <span style="color: #616e88;">;; </span><span style="color: #616e88;">"disables "mode-line setting by project; extreme hang-up over SSH/Tramp</span>
  (<span style="color: #81A1C1;">setq</span> projectile-mode-line <span style="color: #A3BE8C;">"Projectile"</span>)
  (add-to-list 'projectile-globally-ignored-modes <span style="color: #A3BE8C;">"term-mode"</span>)

  (<span style="color: #81A1C1;">use-package</span> <span style="color: #81A1C1;">ggtags</span>
    <span style="color: #81A1C1;">:disabled</span> t
    <span style="color: #81A1C1;">:config</span>
    (<span style="color: #81A1C1;">with-eval-after-load</span> 'evil
        (add-to-list 'evil-emacs-state-modes 'ggtags-view-search-history-mode))

    (add-hook 'c-mode-hook 'ggtags-mode)
    (add-hook 'c++-mode-hook 'ggtags-mode)
    (add-hook 'java-mode-hook 'ggtags-mode)))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgab18d6d" class="outline-3">
<h3 id="orgab18d6d"><span class="section-number-3">5.27</span> <code>rich-minority-mode</code></h3>
<div class="outline-text-3" id="text-5-27">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #81A1C1;">use-package</span> <span style="color: #81A1C1;">rich-minority</span>
  <span style="color: #81A1C1;">:straight</span> t
  <span style="color: #81A1C1;">:config</span>
  (<span style="color: #81A1C1;">defconst</span> <span style="color: #D8DEE9;">my-rm-excluded-modes</span>
    '(
       <span style="color: #A3BE8C;">" pair"</span>
       <span style="color: #A3BE8C;">" Fill"</span>
       <span style="color: #A3BE8C;">" end"</span>
       <span style="color: #A3BE8C;">" Ace - Window"</span>))
  (<span style="color: #81A1C1;">dolist</span> (mode my-rm-excluded-modes)
    (add-to-list 'rm-excluded-modes mode)))
</pre>
</div>
</div>
</div>
