index.html

<div id="outline-container-org34a7a35" class="outline-3">
<h3 id="org34a7a35"><span class="section-number-3">5.28</span> <code>smart-mode-line</code></h3>
<div class="outline-text-3" id="text-5-28">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #81A1C1;">use-package</span> <span style="color: #81A1C1;">smart-mode-line</span>
  <span style="color: #81A1C1;">:straight</span> t
  <span style="color: #81A1C1;">:init</span>
  (<span style="color: #81A1C1;">setq</span> sml/theme 'respectful)
  <span style="color: #81A1C1;">:config</span>
  (sml/setup)
  (smart-mode-line-enable))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbd40932" class="outline-3">
<h3 id="orgbd40932"><span class="section-number-3">5.29</span> <code>tramp</code></h3>
<div class="outline-text-3" id="text-5-29">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #81A1C1;">use-package</span> <span style="color: #81A1C1;">tramp</span>
  <span style="color: #81A1C1;">:init</span>
  (<span style="color: #81A1C1;">setq</span> tramp-default-method <span style="color: #A3BE8C;">"ssh"</span>)
  (<span style="color: #81A1C1;">setq</span> password-cache-expiry nil)
  <span style="color: #81A1C1;">:config</span>

  (add-to-list 'tramp-remote-path <span style="color: #A3BE8C;">"~/bin"</span>))
</pre>
</div>
</div>
</div>

<div id="outline-container-org15edbe5" class="outline-3">
<h3 id="org15edbe5"><span class="section-number-3">5.30</span> <code>undo-tree</code></h3>
<div class="outline-text-3" id="text-5-30">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #81A1C1;">use-package</span> <span style="color: #81A1C1;">undo-tree</span>
  <span style="color: #81A1C1;">:diminish</span> undo-tree-mode
  <span style="color: #81A1C1;">:bind</span> (<span style="color: #A3BE8C;">"C-&lt;backspace&gt;"</span> . undo-tree-undo))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc186910" class="outline-3">
<h3 id="orgc186910"><span class="section-number-3">5.31</span> <code>w3m</code></h3>
<div class="outline-text-3" id="text-5-31">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #81A1C1;">use-package</span> <span style="color: #81A1C1;">w3m</span>
  <span style="color: #81A1C1;">:straight</span> t
  <span style="color: #81A1C1;">:bind</span> (<span style="color: #81A1C1;">:map</span> w3m-mode-map
         (<span style="color: #A3BE8C;">"P"</span> . w3m-view-previous-page)
         (<span style="color: #A3BE8C;">"n"</span> . w3m-tab-next-buffer)
         (<span style="color: #A3BE8C;">"p"</span> . w3m-tab-previous-buffer)
         (<span style="color: #A3BE8C;">"w"</span> . w3m-delete-buffer))
  <span style="color: #81A1C1;">:commands</span> w3m
  <span style="color: #81A1C1;">:init</span>
  (<span style="color: #81A1C1;">with-eval-after-load</span> 'helm-exec
    (helm-exec-register-executable 'w3m))
  (<span style="color: #81A1C1;">setq</span> w3m-fill-column 80)

  <span style="color: #81A1C1;">:config</span>
  (<span style="color: #81A1C1;">with-eval-after-load</span> 'evil
    (add-to-list 'evil-emacs-state-modes 'w3m-session-select-mode))
  (<span style="color: #81A1C1;">with-eval-after-load</span> 'ace-link
    (<span style="color: #81A1C1;">bind-keys</span> <span style="color: #81A1C1;">:map</span> w3m-mode-map
               (<span style="color: #A3BE8C;">"o"</span> . ace-link-w3m)))

  (<span style="color: #81A1C1;">unbind-key</span> <span style="color: #A3BE8C;">"B"</span> w3m-mode-map))

(<span style="color: #81A1C1;">use-package</span> <span style="color: #81A1C1;">w3m-session</span>
  <span style="color: #81A1C1;">:after</span> w3m)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org19b85a4" class="outline-2">
<h2 id="org19b85a4"><span class="section-number-2">6</span> (Un)license</h2>
<div class="outline-text-2" id="text-6">
<div class="org-src-container">
<pre class="src src-text">This is free and unencumbered software released into the public domain.

Anyone is free to copy, modify, publish, use, compile, sell, or
distribute this software, either in source code form or as a compiled
binary, for any purpose, commercial or non-commercial, and by any
means.

In jurisdictions that recognize copyright laws, the author or authors
of this software dedicate any and all copyright interest in the
software to the public domain. We make this dedication for the benefit
of the public at large and to the detriment of our heirs and
successors. We intend this dedication to be an overt act of
relinquishment in perpetuity of all present and future rights to this
software under copyright law.

THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND,
EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.
IN NO EVENT SHALL THE AUTHORS BE LIABLE FOR ANY CLAIM, DAMAGES OR
OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE,
ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR
OTHER DEALINGS IN THE SOFTWARE.

For more information, please refer to <a href="http://unlicense.org">&lt;http://unlicense.org&gt;</a>
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Jonathan Jin</p>
<p class="date">Created: 2019-03-03 Sun 08:51</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
